{
  "latest_videos": [
    {
      "video_id": "YB5pBCH9uiw",
      "video_title": "Ellie’s Hotel Party Adventure with Friends Andrea & Eric!",
      "video_description": "Ellie checks into Uncle Paul’s hotel, but nothing seems to go her way! From elevator mix-ups and room switches to surprise parties, Ellie faces one challenge after another. Frustrated, she learns a valuable lesson from her friends Andrea and Eric: sometimes, it’s best to be patient and think about others, even when things don’t go as planned. Uncle Paul reminds Ellie that being kind can turn any bad day around. Join Ellie’s funny adventure and see how a little kindness can make everything better!\n\nLesson Highlight: When things don’t go your way, staying kind and patient can make the day brighter for everyone!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-31T12:00:44",
      "video_thumbnail_url": "https://i.ytimg.com/vi/YB5pBCH9uiw/maxresdefault.jpg",
      "video_view_count": 102355,
      "video_like_count": 473
    },
    {
      "video_id": "iVpNIyn6H0Y",
      "video_title": "Eric & Kaden's Spooky Adventure! Mummies & Dracula Chase",
      "video_description": "Kaden, Eric, and Uncle Jim go on an epic adventure when their ball bounces into a secret door! They explore spooky tunnels, face mummies, dodge boulders, and even outsmart Dracula using garlic necklaces! Along the way, they learn the importance of teamwork and bravery. Will they make it home safely, or will Kaden's curiosity lead them on another wild chase? Join the fun and see what happens!\n\nLesson Learned: Teamwork and quick thinking help Kaden, Eric, and Uncle face scary challenges, proving that sticking together can save the day!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-29T12:00:52",
      "video_thumbnail_url": "https://i.ytimg.com/vi/iVpNIyn6H0Y/maxresdefault.jpg",
      "video_view_count": 360390,
      "video_like_count": 709
    },
    {
      "video_id": "2uPySDValdE",
      "video_title": "Pirate Ben Learns to Share in the Pool with Andrea & Bobby!",
      "video_description": "Pirate Ben is making big splashes in the pool, bothering Andrea and Bobby! When Ben refuses to stop, Lifeguard Luke puts him in time-out. After time-out, Ben tries to split the pool unfairly, but Lifeguard Luke steps in again. Finally, Andrea and Bobby show kindness by giving Ben the best float, teaching him an important lesson about sharing. Watch how the kids learn that sharing and kindness make pool time more fun for everyone!\n\nLesson Highlight:\nThe lesson in this video is about the importance of sharing and being kind to others, showing that everyone has more fun when they play together and share.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-28T11:00:04",
      "video_thumbnail_url": "https://i.ytimg.com/vi/2uPySDValdE/maxresdefault.jpg",
      "video_view_count": 450235,
      "video_like_count": 9706
    },
    {
      "video_id": "5Abdxnaj7eA",
      "video_title": "Hide and Seek Maze Chase Challenge with Maddie Eva & Wendy",
      "video_description": "Maddie, Eva, Wendy, and Uncle Jim go on a fun-filled chase through a giant maze! The kids play hide-and-seek with Uncle Jim, dodging foam blocks, yarn, and even insects! But Uncle Jim has a mission – it's time to clean up their rooms and help around the house! Will the kids escape, or will Uncle catch them before their chores are done? Watch as they learn that even after all the fun, it’s important to finish their tasks! A hilarious adventure with a great lesson about responsibility and teamwork!\n\nLesson: Playing is fun, but we must always finish our chores!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-27T12:00:05",
      "video_thumbnail_url": "https://i.ytimg.com/vi/5Abdxnaj7eA/maxresdefault.jpg",
      "video_view_count": 914958,
      "video_like_count": 2110
    },
    {
      "video_id": "clOad2aGA40",
      "video_title": "Playground Safety Rules: Wendy & Eric’s Park Adventure!",
      "video_description": "Eric and Wendy learn how to play safely by following playground rules, keeping a safe distance, staying hydrated, and washing away germs after having fun. Watch as they enjoy swinging, sliding, running around, and remembering important lessons like checking the slide, drinking water, and washing their hands. Safety and health come first, and with Uncle Jim’s help, Eric and Wendy give a big thumbs up for following the rules!\n\nLesson Highlight: Playing safely means paying attention to the rules, staying hydrated, and keeping your hands clean. It's fun to stay safe!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-26T11:00:44",
      "video_thumbnail_url": "https://i.ytimg.com/vi/clOad2aGA40/maxresdefault.jpg",
      "video_view_count": 778339,
      "video_like_count": 17094
    },
    {
      "video_id": "lisUGE0gEus",
      "video_title": "Maddie vs Kaden Ball Pit Pool Party: Pink or Blue in the Pool?",
      "video_description": "Maddie and Kaden fill the pool with their favorite colored ball pits—Maddie loves pink, and Kaden loves blue! They compete to see which color is the best, using fun floaties, remote control cars, and even getting delicious shave ice from Auntie Beth. After some playful splashing, Kaden learns the importance of saying sorry, and the two friends discover that mixing pink and blue is even more fun! Join them for this colorful adventure, and remember—always ask an adult before swimming!\n\nLesson Learned: It's okay to have different favorites, but sharing and working together can make things even more fun. Plus, always be kind and apologize when you've made a mistake!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-25T12:00:56",
      "video_thumbnail_url": "https://i.ytimg.com/vi/lisUGE0gEus/maxresdefault.jpg",
      "video_view_count": 904541,
      "video_like_count": 1406
    },
    {
      "video_id": "ceC6o7-YFDE",
      "video_title": "Maddie and Ben’s Park Surprise Adventure: Flying Kites and Ducks!",
      "video_description": "Maddie and Ben are super excited to play at the park, enjoying the see-saw, swing, and slide! But when Uncle Luke closes the park for maintenance, they feel disappointed. Luckily, Uncle Jim comes to the rescue by taking them to Harveston Park! At first, Maddie and Ben think the new park is boring with no slides or swings, but then they discover the fun of flying kites and meeting ducks! They learn that every place has its own special surprises—you just need to give it a chance!\n\nLesson Learned: Sometimes new places can be even more fun than you expect when you explore new things!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-24T11:00:45",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ceC6o7-YFDE/maxresdefault.jpg",
      "video_view_count": 4425149,
      "video_like_count": 78961
    },
    {
      "video_id": "LRoIT0rgamg",
      "video_title": "Ellie & Maddie's Littlest Pet Shop Teamwork Adventure!",
      "video_description": "This is an ad. Ellie visits Uncle Jim and Maddie’s Littlest Pet Shop, excited to play with new pet toys! But with so many customers asking for help at once, things get a little busy. Maddie and Uncle Jim work together to help everyone while Ellie discovers the perfect playset for her capybara. Along the way, they all learn the importance of being patient and helping each other. Watch as Ellie, Maddie, and Uncle Jim create a grooming area and a daily pet care list for their furry friends\n\nLesson Learned: This story teaches kids the value of patience, teamwork, and helping others, even when things get busy!\n\nParents, to learn more about Littlest Pet Shop, visit www.littlestpetshop.com. By creating an account, you can track your collection, create a wish list and be up to date on everything in the world of LPS! \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-23T12:00:34",
      "video_thumbnail_url": "https://i.ytimg.com/vi/LRoIT0rgamg/maxresdefault.jpg",
      "video_view_count": 143749,
      "video_like_count": 572
    },
    {
      "video_id": "fqpHBLQhUpk",
      "video_title": "Jannie Breaks Charlotte's Lego – But They Fix It Together!",
      "video_description": "Jannie accidentally breaks Charlotte's special Lego project and feels really bad. Instead of keeping it a secret, Jannie decides to be honest and tells Charlotte what happened. Together, they learn the power of teamwork as they rebuild the project with Uncle's help. The lesson? When you work together and tell the truth, you can fix anything!\n\nLesson: Honesty and teamwork can solve even the toughest problems!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-22T11:00:55",
      "video_thumbnail_url": "https://i.ytimg.com/vi/fqpHBLQhUpk/maxresdefault.jpg",
      "video_view_count": 1845042,
      "video_like_count": 31763
    },
    {
      "video_id": "LuQfCrN7fcs",
      "video_title": "Ellie Ben & Charlotte’s Crazy Car Clean-Up Adventure!",
      "video_description": "Ellie, Charlotte, Ben, and Uncle Paul are in charge of cleaning a super messy car filled with surprises! From ball pit mishaps to a tricky car window, the team has their hands full. Things get even wilder when Uncle Clown shows up and Charlotte accidentally vacuums his hair! But to everyone’s surprise, the clown loves his new look! Just when they think the fun is over, Spiderman arrives with a car full of webs—and Uncle Paul turns into a lizard! With teamwork, quick thinking, and some help from Spiderman, the kids save the day and turn Paul back to normal. The lesson? Working together and having fun can solve any problem!\n\nLesson Learned: Teamwork and creativity can help solve even the wackiest problems!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-21T12:00:32",
      "video_thumbnail_url": "https://i.ytimg.com/vi/LuQfCrN7fcs/maxresdefault.jpg",
      "video_view_count": 3315368,
      "video_like_count": 1914
    },
    {
      "video_id": "sXxJcNw9pcg",
      "video_title": "Wendy Learns the Best Swimmers Help Others!",
      "video_description": "Wendy is an amazing swimmer and loves showing off her cool skills with dives and cannonballs! Eva is super impressed and asks Wendy to teach her how to swim, but Wendy is too busy. When Uncle Jim points out that the best swimmers also help others, Wendy realizes what she needs to do! She decides to teach Eva how to swim, and they have a splashy fun time learning together. This video shows the importance of helping others and sharing what you know to be the best at something!\n\nLesson: Helping others makes you even better at the things you're good at!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-20T11:00:59",
      "video_thumbnail_url": "https://i.ytimg.com/vi/sXxJcNw9pcg/maxresdefault.jpg",
      "video_view_count": 2461147,
      "video_like_count": 55540
    },
    {
      "video_id": "E_slogErF38",
      "video_title": "Andrea & Ellie’s Big Mall Adventure: Learn Mall Safety Rules & Lessons for Kids",
      "video_description": "Andrea and Ellie are super excited for a day of fun at the mall with Uncle and Aunty Beth! From riding the escalator to jumping on trampolines, shopping, and enjoying yummy snacks, they learn important lessons along the way. With each adventure, Uncle reminds them to follow the rules, be safe, and show good manners. From not running in the mall to cleaning up after themselves, the kids discover that listening and being courteous is key to having a great day. Join the fun and learn why following rules makes everything more enjoyable!\n\nLesson: Following rules and being considerate to others helps keep everyone safe and happy.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-19T12:00:17",
      "video_thumbnail_url": "https://i.ytimg.com/vi/E_slogErF38/maxresdefault.jpg",
      "video_view_count": 5608607,
      "video_like_count": 5565
    },
    {
      "video_id": "Fj8fu9FNLuY",
      "video_title": "Wendy and Eva’s Playhouse Adventure: Sharing Makes Friends!",
      "video_description": "Wendy has a cool pool house but doesn’t want to share it with Eva. Feeling sad, Eva finds Uncle Jim, who invites her to play at his toy house instead. Eva has so much fun pretending to cook and sliding down the house! When Wendy sees Eva having fun, she wants to join but is too shy to ask. Eva kindly invites Wendy to play, and Wendy learns that sharing makes everything more fun! This heartwarming story teaches an important lesson about friendship and the joy of sharing.\n\nLesson Highlight: Sharing with friends makes playtime even better and more fun for everyone!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-18T11:00:29",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Fj8fu9FNLuY/maxresdefault.jpg",
      "video_view_count": 49651036,
      "video_like_count": 847772
    },
    {
      "video_id": "mr_tV2AFkuk",
      "video_title": "Rich King Kaden vs Kind King Eric Royal Challenge: Lesson about Sharing",
      "video_description": "Kaden is the rich king with everything he could wish for, while Eric is the poor king with barely enough to get by. The two kings go through challenges, from toys and food to a final contest to see who is the \"best king.\" But in the end, it’s not riches or power that wins—it’s kindness! Eric shares what little he has, and that makes him the true king of hearts. Join Kaden and Eric as they learn a valuable lesson about how being kind is what truly makes you royal!\n\nLesson Learned:\nThe best king isn't the richest but the kindest! Sharing and helping others is more important than having lots of things.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-17T12:01:03",
      "video_thumbnail_url": "https://i.ytimg.com/vi/mr_tV2AFkuk/maxresdefault.jpg",
      "video_view_count": 1577791,
      "video_like_count": 1437
    },
    {
      "video_id": "l_As2v4xxDY",
      "video_title": "Maddie Falls Asleep During Shopping Adventure!",
      "video_description": "Maddie is so sleepy during a shopping trip with Auntie Beth that she keeps napping in the shopping cart! Despite the sleepiness, they shop for Uncle Jim's birthday. But when it's time to bake a cake and wrap gifts, Maddie's drowsy mistakes cause some funny surprises! The cake gets burned, and her gift box is empty. Feeling bad, Maddie makes it right by baking another cake and drawing a special picture for Uncle Jim. This fun adventure teaches kids the importance of being responsible, even when you're tired!\n\nLesson:\nSometimes we make mistakes, but it's important to try our best to make things right and show our love through thoughtful actions!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-15T12:01:03",
      "video_thumbnail_url": "https://i.ytimg.com/vi/l_As2v4xxDY/maxresdefault.jpg",
      "video_view_count": 5292236,
      "video_like_count": 8761
    },
    {
      "video_id": "_gnHMptZyHw",
      "video_title": "No Snacks in the Pool – Ben and Bobby Learn Why!",
      "video_description": "Ben and Bobby are having a blast by the pool, but things get a little silly when they start messing with the pool rules! Lifeguard Luke tells them, \"No snacks in the pool,\" but Ben and Bobby decide to have some fun by changing the signs. Chaos ensues as they sneakily replace the rules with goofy ones! In the end, Lifeguard Luke gives them a time-out, and the boys learn an important lesson about following the rules and keeping the pool clean. It's all fun and games, but cleaning up isn’t as fun as it sounds!\n\nLesson Learned: Always follow the rules and keep your environment clean to have safe and fun adventures!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-14T11:00:39",
      "video_thumbnail_url": "https://i.ytimg.com/vi/_gnHMptZyHw/maxresdefault.jpg",
      "video_view_count": 2971521,
      "video_like_count": 44099
    },
    {
      "video_id": "Oj2spp3Siek",
      "video_title": "Wendy Charlotte & Doctor Maddie’s Ambulance Rescue: Teddy Bear to the Hospital!",
      "video_description": "Maddie is on a rescue mission with her trusty ambulance! From fixing teddy bears and helping animals to saving her friends Charlotte and Wendy, Doctor Maddie shows everyone how to take care of themselves. Along the way, Maddie teaches important lessons like washing your hands, brushing your teeth, and eating healthy. Whether it's helping with a sore tummy, fixing a flat tire, or a dentist trip, Maddie is always ready to help! Join the fun as Maddie and her friends learn how to stay safe and healthy!\n\nLesson Learned: Maddie teaches kids the importance of taking care of themselves by washing hands before eating, brushing teeth after sweets, and balancing fun with healthy habits.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-13T12:00:22",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Oj2spp3Siek/maxresdefault.jpg",
      "video_view_count": 2077894,
      "video_like_count": 2499
    },
    {
      "video_id": "07MWvJyaFSo",
      "video_title": "Jannie Eric & Charlotte Halloween Spooky Costume Contest with Bowser!",
      "video_description": "Mario Eric, Princess Peach Charlotte , Wednesday Jannie, and Bowser Uncle Luke are all dressed up for a fun Halloween Costume Contest! But when Bowser shows up and causes a mess, everyone is a bit nervous. Bowser apologizes for the chaos and, together with his friends, helps clean everything up. The contest continues with lots of laughs, and the lesson of the day is to always be kind and work together, no matter our differences!\n\nLesson Learned:\nEven when things go wrong, working together and being kind can make everything better!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-12T11:00:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/07MWvJyaFSo/maxresdefault.jpg",
      "video_view_count": 1971870,
      "video_like_count": 39225
    },
    {
      "video_id": "RhDuWypwenk",
      "video_title": "Ellie’s Boba Machine Spills and Thrills Adventure!",
      "video_description": "Ellie is excited to make some yummy Boba drinks, but things don’t go as planned when the machine starts acting up! With Uncle Sam by her side, they tackle spills, messes, and a broken machine. After a lot of laughs and teamwork, Ellie, Uncle Sam, and their friends finally get the machine working! The fun doesn't stop there—Ellie's friends even pitch in to make a special batch of Boba just for her. Through all the ups and downs, Ellie learns that it’s important to keep trying and never give up when things go wrong!\n\nLesson: When things don't go as planned, don’t give up! Teamwork and patience help solve problems.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-11T12:00:34",
      "video_thumbnail_url": "https://i.ytimg.com/vi/RhDuWypwenk/maxresdefault.jpg",
      "video_view_count": 6906146,
      "video_like_count": 5812
    },
    {
      "video_id": "bL7LprAgZZY",
      "video_title": "Jannie and Alex's Race to Build the Biggest Block Tower Teamwork Challenge!",
      "video_description": "Jannie and Alex are having fun building with blocks, but things get a little wild when Jannie becomes too competitive! The two friends embark on an exciting race through the colorful streets of Kaleidoscope City, where they learn a valuable lesson: teamwork beats competition! Watch as they discover that by working together, they can build the tallest tower ever. It's a fun-filled adventure with a great lesson about cooperation and friendship!\n\nLesson Highlight: Teamwork makes everything easier—and way more fun! Jannie and Alex learn that working together helps them achieve greater things than competing alone.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-09T12:00:43",
      "video_thumbnail_url": "https://i.ytimg.com/vi/bL7LprAgZZY/maxresdefault.jpg",
      "video_view_count": 152700,
      "video_like_count": 397
    },
    {
      "video_id": "x56Hriy48pk",
      "video_title": "Stuck Together! Kaden & Eric's Learn to Share Teamwork Adventure",
      "video_description": "Kaden and Eric find themselves hilariously stuck together after an argument over a toy! As they try to figure out how to break free, they learn a valuable lesson about teamwork and sharing. From tug-of-war battles over floaties to pranks with ice water and bugs, the boys finally realize that working together is the key to solving their problems. When they team up to catch a bad guy and build a foam block house, they prove that friendship and cooperation are the best ways to have fun!\n\nLesson Learned:\nTeamwork and sharing make everything better, even when you're stuck together!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-07T12:01:15",
      "video_thumbnail_url": "https://i.ytimg.com/vi/x56Hriy48pk/maxresdefault.jpg",
      "video_view_count": 4080620,
      "video_like_count": 2683
    },
    {
      "video_id": "qRMoKdP12ZM",
      "video_title": "Ellie and Andrea Conquer the Big Slide and Be Brave!",
      "video_description": "Ellie and Andrea are having a blast at the park, sliding down all the different slides. But when it’s time to go on the BIG slide, Andrea feels scared! With a little encouragement from Uncle and Ellie, the two friends decide to face their fears together. Watch as they conquer the slide and discover how much fun it is to be brave! This video teaches a great lesson about facing your fears with the help of friends!\n\nLesson: Being brave is easier when you have a friend by your side, and it’s okay to be scared sometimes!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-06T11:15:05",
      "video_thumbnail_url": "https://i.ytimg.com/vi/qRMoKdP12ZM/maxresdefault.jpg",
      "video_view_count": 35757800,
      "video_like_count": 603544
    },
    {
      "video_id": "J0gOmWnJ6TY",
      "video_title": "Ellie & Charlotte Learn to Stop Wasting Water!",
      "video_description": "Ellie is on a mission to save water! When she finds Uncle wasting water in the backyard and kitchen, Ellie shows him how to use just the right amount. She even teaches everyone in the house about the importance of water conservation. Charlotte surprises Ellie with smart water-saving tips while giving her dog a bath! Join Ellie and her friends as they learn fun and easy ways to stop wasting water and help the environment. Lesson: Be mindful of how much water you use – every drop counts!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-05T12:00:25",
      "video_thumbnail_url": "https://i.ytimg.com/vi/J0gOmWnJ6TY/maxresdefault.jpg",
      "video_view_count": 6305868,
      "video_like_count": 3333
    },
    {
      "video_id": "ys_m4cAc8fM",
      "video_title": "Family Fishing Camping Adventure with Andrea Ben & Bobby",
      "video_description": "Join Ben, Bobby, and Andrea on their fun camping adventure with Uncle Luke! Even though they can't stop looking at their phones, Uncle Luke has a better idea—let's go fishing! At first, it seems boring, but when a fish appears, the kids jump into action. Watch how Andrea catches the fish, and everyone enjoys a campfire meal! Discover how spending time with family is way more fun than staring at a screen.\n\nLesson Learned: Spending quality time with family and friends is way more fun than being glued to your phone!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-04T11:01:13",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ys_m4cAc8fM/maxresdefault.jpg",
      "video_view_count": 110917378,
      "video_like_count": 1766210
    },
    {
      "video_id": "S7J2RjB54dk",
      "video_title": "Maddie and Eva's Spin the Wheel Clean Up Challenge!",
      "video_description": "Maddie and Eva have fun playing with the magical spin-the-wheel game, but things take a messy turn when they start cheating and making Uncle do all the chores! From washing dishes to cleaning up the backyard, Uncle is stuck doing all the work. But when the kids realize how tired Uncle is, they decide to clean up and make things right. Watch as they learn the importance of playing fair and helping with chores. In the end, they all have fun and play the game the right way!\n\nLesson Learned: It's important to play fair and help out with chores to make everyone happy!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-03T12:00:28",
      "video_thumbnail_url": "https://i.ytimg.com/vi/S7J2RjB54dk/maxresdefault.jpg",
      "video_view_count": 1445286,
      "video_like_count": 1029
    },
    {
      "video_id": "aDJgRHYhrq4",
      "video_title": "Ellie & Andrea’s Spooky Halloween Cleanup with Beetlejuice Magic!",
      "video_description": "Andrea is cleaning her room, but things quickly spiral out of control when she tries to stuff a giant inflatable into her closet! Luckily, Ellie, a mischievous Beetlejuice character, appears to \"help\"—but her magic only makes a bigger mess! Together, Andrea and Ellie learn that cleaning up isn’t as easy as it seems, especially when spooky surprises like a sandworm pop out! In the end, they work together to bake cookies, paint pumpkins, and get ready for a Halloween party. The fun lesson? Sometimes teamwork (and a little magic) can make even the toughest tasks more fun!\n\nLesson Highlight: Teamwork and helping each other can make even messy situations a lot more fun!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n🎉 Come hang out with the Toys and Colors family! 🌈✨ Meet the cast and see all the fun behind the scenes. Check it out at https://toysandcolors.com💖",
      "video_published_at": "2024-10-01T12:00:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/aDJgRHYhrq4/maxresdefault.jpg",
      "video_view_count": 1839028,
      "video_like_count": 1203
    },
    {
      "video_id": "6xMymJIz5MQ",
      "video_title": "Andrea & Ben's Movie Theater Manners Adventure!",
      "video_description": "Andrea, Ben, and their uncles head to the movie theater for a fun family day! Things get a little messy when Andrea spills popcorn and Ben kicks the seat, but they all learn valuable lessons about being considerate in public. From rushing in late to noisy popcorn munching, it's all about respecting others and keeping the theater quiet for everyone to enjoy the movie. After the show, they remember to clean up and take care of their trash. Watch and learn how to make movie time with family fun and respectful!\n\nLesson: We learn the importance of being considerate, respecting others, and cleaning up after ourselves, especially in public places like the movie theater!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n📚 Toys and Colors eBooks! 🌈 Perfect for storytime anytime. Read with your kids: https://toysandcolors.com/storytime-ebooks  📖💖 \n#toysandcolors #StorytimeFun #KidsEbooks",
      "video_published_at": "2024-09-29T12:00:05",
      "video_thumbnail_url": "https://i.ytimg.com/vi/6xMymJIz5MQ/maxresdefault.jpg",
      "video_view_count": 10191980,
      "video_like_count": 4847
    },
    {
      "video_id": "b05mP3XKkEc",
      "video_title": "Beetlejuice Ellie Magical Mess Cleanup Adventure",
      "video_description": "Andrea just finished cleaning her room, but when she tries to shove a giant inflatable toy into her closet, it causes a huge mess! Things get even wilder when Ellie, the magical trickster, appears to “help” after Andrea calls her name three times. But instead of cleaning, Ellie’s magic makes the mess fly all over the place! Will Andrea ever get her room tidy again? Find out what happens and learn the lesson of patience and doing things the right way!\n\nLesson Learned: Sometimes magic tricks don’t solve problems—patience and doing things right is always best!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-28T11:00:44",
      "video_thumbnail_url": "https://i.ytimg.com/vi/b05mP3XKkEc/maxresdefault.jpg",
      "video_view_count": 10119566,
      "video_like_count": 173625
    },
    {
      "video_id": "DpcuhxZVeWo",
      "video_title": "Maddie Learns Learns to Wash Her Hands and Eat Right with Doctor Kaden!",
      "video_description": "Maddie loves hamburgers, video games, and fun in the garden—but all that excitement leaves her with some funny stickers on her face! First, she learns from Doctor Kaden that eating too many hamburgers isn’t healthy, and she swaps them for an apple to make her face clear up. Then, dirty hands in the garden bring more stickers from sneaky germs! Maddie washes up and learns the importance of staying clean. Finally, after too much video game and phone time, Maddie gets even more stickers! Doctor Kaden teaches her to take breaks and read a book instead. Join Maddie as she learns healthy habits to keep her face sticker-free!\n\nLesson Learned: Maddie discovers the importance of eating healthy, washing her hands, and balancing screen time with other activities like reading!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n🌟 Meet the amazing Toys and Colors cast! 🎉 Get to know all your favorite faces right here: https://ToysandColors.com/cast! 💖",
      "video_published_at": "2024-09-27T12:00:15",
      "video_thumbnail_url": "https://i.ytimg.com/vi/DpcuhxZVeWo/maxresdefault.jpg",
      "video_view_count": 5462794,
      "video_like_count": 2366
    },
    {
      "video_id": "3jbRE3DqE6k",
      "video_title": "Eric’s Day Out: Loud Music and Learning to Share the Pool!",
      "video_description": "Eric’s pool day fun gets a little too wild! From splashing big waves to blasting loud music, Eric is causing all sorts of trouble at the pool. Lifeguard Jim puts Eric in a time out after he cuts in line and keeps ignoring the rules. But after learning how to be kind and respectful, Eric finds a fun way to enjoy the pool without disturbing anyone. The lesson? It’s important to be thoughtful of others while having fun!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-26T11:00:06",
      "video_thumbnail_url": "https://i.ytimg.com/vi/3jbRE3DqE6k/maxresdefault.jpg",
      "video_view_count": 53492995,
      "video_like_count": 891510
    },
    {
      "video_id": "7ZL_dQXlH-w",
      "video_title": "Andrea’s Sneaking Candy Adventure & Learning Healthy Lessons!",
      "video_description": "Andrea just can't resist her sweet treats, even when Dr. Ben tells her to rest and avoid candy while she's recovering! She tries hiding candy in all sorts of sneaky places, but Dr. Ben is always one step ahead. After several funny attempts to outsmart him, Andrea learns that eating healthy food helps her feel much better! By the end, she's back to her energetic self and ready to take on the day. The lesson? Sometimes healthy choices are the sweetest way to feel better!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-25T12:00:09",
      "video_thumbnail_url": "https://i.ytimg.com/vi/7ZL_dQXlH-w/maxresdefault.jpg",
      "video_view_count": 3771007,
      "video_like_count": 2764
    },
    {
      "video_id": "6b2ValOVh8A",
      "video_title": "Charlotte and Jannie’s Obstacle Course Fitness Adventure!",
      "video_description": "Charlotte wants to stay active, but Jannie feels too tired to join in! Whether it’s playing games, fixing things, or working out, Jannie just can’t seem to find the energy. But with a little encouragement from Charlotte and Auntie Beth, Jannie learns that staying active can make you feel better and give you more energy. Watch as Jannie goes from being lazy to winning a race with her friends! The fun never stops when you keep moving!\n\nLesson Learned: It’s important to stay active! Moving around and exercising can help boost your energy and make you feel great.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-23T12:00:09",
      "video_thumbnail_url": "https://i.ytimg.com/vi/6b2ValOVh8A/maxresdefault.jpg",
      "video_view_count": 300852,
      "video_like_count": 1418
    },
    {
      "video_id": "AbXB2VyOhec",
      "video_title": "Andrea and Ellie Play Basketball in the Swimming Pool with a Mermaid!",
      "video_description": "Andrea and Ellie are having a blast playing basketball by the pool! When Mermaid Emma asks to join, they tell her it's a one-on-one game. But after the ball accidentally flies into the pool, Emma helps retrieve it, and Andrea and Ellie realize it's even more fun to play together! They apologize and invite Emma to join, and the three of them have a great time. The lesson? Including others can make games even more fun!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-22T12:00:14",
      "video_thumbnail_url": "https://i.ytimg.com/vi/AbXB2VyOhec/maxresdefault.jpg",
      "video_view_count": 11471194,
      "video_like_count": 228264
    },
    {
      "video_id": "nNsSL55MDgk",
      "video_title": "Charlotte and Ellie’s Big Seesaw Adventure!",
      "video_description": "Ellie and Charlotte are having a blast on the seesaw until Charlotte has to leave for tutoring. Left alone, Ellie tries to keep the fun going by using her stuffed animals! She learns a clever trick about balance and leverage when she helps Uncle pick apples from a tree. In the end, everyone celebrates with pizza, and Ellie learns the importance of teamwork and creative problem-solving.\n\nLesson Learned: Teamwork and creativity can turn challenges into fun solutions!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-21T12:00:57",
      "video_thumbnail_url": "https://i.ytimg.com/vi/nNsSL55MDgk/maxresdefault.jpg",
      "video_view_count": 9713848,
      "video_like_count": 5311
    },
    {
      "video_id": "0VNEy9L61i4",
      "video_title": "Andrea & Ellie’s Awesome Science and Friendship Day!",
      "video_description": "Uncle Paul shows Andrea and Ellie how to pop a balloon without popping it, and the magic of static electricity with pepper! But that’s not all – the fun continues with poolside basketball, where Mermaid Emma saves the day. The girls learn the importance of including friends and how sharing makes everything better. With a fishing trip that teaches kindness, friendship, and sharing, this video is packed with fun and valuable lessons!\n\nLesson Learned: Sharing and being kind to others not only makes us feel good but also strengthens our friendships. Including others and sharing what we have is always the right thing to do.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-20T23:30:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/0VNEy9L61i4/maxresdefault.jpg",
      "video_view_count": 107546124,
      "video_like_count": 1484563
    },
    {
      "video_id": "c96jRkgN-LQ",
      "video_title": "Ellie and Andrea vs. Mr. Burger's Magic Burgers Adventure! 🍔",
      "video_description": "Mr. Burger keeps escaping from Burger Jail to share his magical burgers with everyone! Ellie, Andrea, and Emma try their best to stop him, but Mr. Burger's love for making burgers keeps getting him into trouble. Along the way, they learn an important lesson: while burgers are yummy, it's important not to have too much! Moderation is key to feeling just right and enjoying your favorite foods. Can the kids help Mr. Burger learn when enough is enough?\n\nLesson Learned:\nEnjoy your favorite foods, but remember not to overeat! Feeling full and satisfied is much better than feeling stuffed.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n🎉 Come hang out with the Toys and Colors family! 🌈✨ Meet the cast and see all the fun behind the scenes. Check it out at https://www.ToysandColors.com! 💖",
      "video_published_at": "2024-09-19T18:49:56",
      "video_thumbnail_url": "https://i.ytimg.com/vi/c96jRkgN-LQ/maxresdefault.jpg",
      "video_view_count": 7359446,
      "video_like_count": 4370
    },
    {
      "video_id": "Eni6q1R-0YA",
      "video_title": "Police Andrea & Kaden Learns the Truth About Soda Time-Out!",
      "video_description": "Kaden, Auntie Beth, and Uncle Jim keep getting caught by Police Andrea for drinking too much soda—but there's a twist! It turns out they weren’t drinking soda at all! Kaden was using the cans for his school project, Auntie Beth for cooking, and Uncle Jim made a piggy bank! After all the confusion, Police Andrea realizes her mistake and learns that things aren’t always what they seem. The lesson? Don’t jump to conclusions, and remember—too much soda is bad for you!\n\nLesson: It's important to understand the full story before making assumptions. And always limit your soda intake for a healthy lifestyle!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n🌟 Meet the amazing Toys and Colors cast! 🎉 Get to know all your favorite faces right here: https://ToysandColors.com/cast! 💖",
      "video_published_at": "2024-09-17T12:00:14",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Eni6q1R-0YA/maxresdefault.jpg",
      "video_view_count": 3348750,
      "video_like_count": 2514
    },
    {
      "video_id": "UWv7LLe4XQE",
      "video_title": "Andrea & Ben Late Night Games or Fun Day Out Adventure",
      "video_description": "Andrea loves playing late at night, but when she skips sleep, she misses out on all the fun! Uncle Paul and Ben have an awesome picnic day with games, kites, and even a roller slide, but Andrea sleeps through it all. When she wakes up, she's sad she missed out, so she decides to make a big change. Watch as Andrea learns the importance of going to bed on time so she can enjoy the next fun-filled day with her family!\n\nLesson: It's important to get enough sleep so you don't miss out on all the exciting things happening during the day!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n🎉 Get a special shoutout or cameo from your favorite Toys and Colors cast! 🌈 Send some love or surprise someone here: https://www.toysandcolors.com/shoutouts/tb-wfmjiPKg 💖",
      "video_published_at": "2024-09-15T12:00:34",
      "video_thumbnail_url": "https://i.ytimg.com/vi/UWv7LLe4XQE/maxresdefault.jpg",
      "video_view_count": 2274523,
      "video_like_count": 1669
    },
    {
      "video_id": "j4KneREsjoI",
      "video_title": "Maddie’s Special Gift for Ben’s Birthday!",
      "video_description": "Maddie wants to give Ben a birthday present but realizes she doesn’t have any money. Instead of giving up, she decides to make something special just for him! She spends time drawing a Pikachu painting, worried it won't be as cool as the other gifts. But when Ben sees the painting, he loves it more than anything else! This heartwarming story teaches us that the best gifts come from the heart, not from how much money we spend.\n\nLesson Learned: It's the thought and effort behind a gift that makes it special, not how expensive it is!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-14T11:00:49",
      "video_thumbnail_url": "https://i.ytimg.com/vi/j4KneREsjoI/maxresdefault.jpg",
      "video_view_count": 12876088,
      "video_like_count": 365309
    },
    {
      "video_id": "0kH4sLtQiEY",
      "video_title": "Kaden Emma & Eric Crazy Pool Fishing Adventure: Teamwork Saves the Day",
      "video_description": "The kids are excited to enjoy their new house by the pool, but when they get hungry, they have to get creative! Emma finds fishing rods, and they all try to catch some food. But instead of fish, they reel in some hilarious surprises—a cow, a horse, and even a cranky chicken! After their pool house gets destroyed, they meet a fisherman who helps them trade for the right bait and catch a golden fish. With their new catch, the kids figure out how to get their old house back. This fun adventure teaches kids the importance of problem-solving, teamwork, and thinking outside the box!\n\nLesson Learned: Sometimes things don’t go as planned, but with teamwork and creativity, you can find solutions and even turn a tricky situation into a fun adventure!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-13T12:00:01",
      "video_thumbnail_url": "https://i.ytimg.com/vi/0kH4sLtQiEY/maxresdefault.jpg",
      "video_view_count": 2595822,
      "video_like_count": 1813
    },
    {
      "video_id": "yx8Vtncko6A",
      "video_title": "Ben and Andrea’s Learn to Reuse Challenge in Class",
      "video_description": "Andrea learns a big lesson about not being wasteful in this fun classroom adventure! When she keeps throwing away her notebooks and pencils, Ben and Mr. Paul remind her that it's better to reuse things. Mr. Paul even shows Andrea how she can give her old books to the library to help others. By the end, Andrea promises to take better care of her supplies and share with those in need. A great reminder to be mindful and not waste what we have!\n\nLesson Learned: It's important to use things wisely and not be wasteful. Sharing old items like books can help others, and reusing school supplies is better for the environment!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-12T11:01:12",
      "video_thumbnail_url": "https://i.ytimg.com/vi/yx8Vtncko6A/maxresdefault.jpg",
      "video_view_count": 14215732,
      "video_like_count": 338292
    },
    {
      "video_id": "vpGIce5rgtg",
      "video_title": "Maddie the Police Stop Silly Thieves in Time Out Jail",
      "video_description": "Maddie the police is on the case! When four mischievous thieves that causes chaos around town, Maddie jumps into action. One steals a phone to make TikTok videos, another destroys a Lego masterpiece, a third makes too much noise in the library, and the last one won’t stop littering. Maddie catches each thief and teaches them a lesson about respecting others and following the rules. Along the way, we learn why it’s important to be responsible, clean up after ourselves, and be considerate of others. Watch as justice is served—Maddie style!\n\nLesson Learned: It's important to be responsible, respect others' belongings, and follow the rules to keep our community happy and safe.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-11T12:01:14",
      "video_thumbnail_url": "https://i.ytimg.com/vi/vpGIce5rgtg/maxresdefault.jpg",
      "video_view_count": 840011,
      "video_like_count": 2728
    },
    {
      "video_id": "ZP1J6av9zbY",
      "video_title": "Jannie Charlotte & Eric's Secrety Mystery Adventure",
      "video_description": "Jannie and Charlotte are searching for a mysterious person causing mischief, but little do they know—Eric is the one behind the mess! From knocking down their cup pyramid to changing their Lego creations and even messing with their art, Eric tries to keep his identity a secret. But when Jannie and Charlotte finally figure it out, they realize Eric wasn’t being mean—just playful! Together, they learn that owning up to mistakes and working as a team is the best way to have fun. This playful adventure teaches kids the value of honesty and friendship!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-09T12:00:41",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ZP1J6av9zbY/maxresdefault.jpg",
      "video_view_count": 569948,
      "video_like_count": 1792
    },
    {
      "video_id": "Iv5BiHtg5DI",
      "video_title": "Andrea's Big Catch: Pirates and Treasure!",
      "video_description": "Andrea is fishing when she reels in something surprising—a treasure chest! Pirates Ben and Jim claim it’s theirs, but Andrea isn’t ready to give it up. The pirates trap Andrea in her house and offer a swap, but they soon regret it when their new home has an unexpected guest—a shark! Andrea steps in to help catch the sharks, and in the end, everyone learns that sharing is better than fighting. A fun adventure with a lesson about sharing and teamwork!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-08T11:00:24",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Iv5BiHtg5DI/maxresdefault.jpg",
      "video_view_count": 15975633,
      "video_like_count": 303121
    },
    {
      "video_id": "usX0Foe3TME",
      "video_title": "Charlotte & Ellie’s Sleepwalking Costume Contest!",
      "video_description": "Ellie’s sleepwalking is causing all sorts of chaos! Uncle Jim tries everything to keep her safe in her bed-jail, from bars to bows, but nothing seems to work. Ellie’s sleepwalking adventures lead her to a costume contest where she wins the scariest costume award, much to everyone’s surprise! Watch as Uncle Jim keeps trying to make the ultimate \"Ellie-proof\" bed, but Ellie always finds a way out! Will Uncle Jim finally succeed, or will Ellie keep sleepwalking her way into trouble? Learn the lesson about persistence, creativity, and the power of never giving up! 🛌😴\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n📚 Toys and Colors eBooks! 🌈 Perfect for storytime anytime. Read with your kids: https://toysandcolors.com/storytime-ebooks  📖💖",
      "video_published_at": "2024-09-07T12:00:59",
      "video_thumbnail_url": "https://i.ytimg.com/vi/usX0Foe3TME/maxresdefault.jpg",
      "video_view_count": 7956110,
      "video_like_count": 5046
    },
    {
      "video_id": "aY7RdzFv2vQ",
      "video_title": "Andrea & Ben Big Lesson in Honesty & Teamwork",
      "video_description": "Andrea's fun day turns into a mess when Ben accidentally knocks down her cup pyramid and Jenga tower with a basketball! Scared to tell the truth, Ben hides, but Uncle Paul teaches him a valuable lesson about honesty. When Ben finally apologizes, Andrea forgives him, and together they rebuild everything. This story highlights the importance of telling the truth, saying sorry, and working together to fix mistakes. Watch as Andrea and Ben learn that honesty is always the best policy!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-06T11:00:01",
      "video_thumbnail_url": "https://i.ytimg.com/vi/aY7RdzFv2vQ/maxresdefault.jpg",
      "video_view_count": 11169857,
      "video_like_count": 225552
    },
    {
      "video_id": "ytG8eWukleU",
      "video_title": "Ellie & Kaden Slime vs Ice Cream: A Gooey Adventure!",
      "video_description": "Ellie, Kaden, and Aunty Beth dive into a messy adventure with ice cream slime! The kids are thrilled to make their own stretchy, gooey creations, but things get a little tricky when Uncle Max thinks it's real ice cream! Watch how the kids save the day by making Uncle Max some real, yummy ice cream and also have some fun with a surprising Slime Monster! The lesson? It's important to be creative, have fun, and always help out those who work hard. Plus, not everything that looks like ice cream is actually edible! 😆🍦\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-05T12:01:10",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ytG8eWukleU/maxresdefault.jpg",
      "video_view_count": 2088616,
      "video_like_count": 1664
    },
    {
      "video_id": "76j-vsguoWA",
      "video_title": "Ellie & Andrea Matching Backpacks for Best Friends",
      "video_description": "Andrea’s backpack gets stuck and rips, leaving her without a way to carry her school supplies! Ellie tries to help by sharing her fun Candy backpack and other creative ideas, but nothing seems to work. When Andrea finally finds a new backpack at the store, Ellie makes a big sacrifice to help her friend. In the end, kindness wins, and both friends walk away with matching backpacks! The lesson? True friendship means sharing and helping each other, even when it’s tough!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-03T12:00:11",
      "video_thumbnail_url": "https://i.ytimg.com/vi/76j-vsguoWA/maxresdefault.jpg",
      "video_view_count": 14348908,
      "video_like_count": 17291
    },
    {
      "video_id": "26LDZEJQXf4",
      "video_title": "Maddie and Eva's Camping Adventure: A Lesson in Teamwork!",
      "video_description": "Maddie and Eva are off on a camping trip, but things don't go as planned! From forgetting important supplies to fixing a flat tire, these two friends face one challenge after another. With Wendy's help, they learn that working together and being considerate of each other makes everything easier. But can they stop arguing long enough to enjoy their camping trip? Join the fun as Maddie and Eva discover the importance of teamwork and helping each other out!\n\nLesson Learned: Teamwork and helping each other are key to a successful adventure!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-01T12:00:02",
      "video_thumbnail_url": "https://i.ytimg.com/vi/26LDZEJQXf4/maxresdefault.jpg",
      "video_view_count": 2445237,
      "video_like_count": 1958
    },
    {
      "video_id": "bLSCWoD8spU",
      "video_title": "Emma’s Giant Food vs. Wendy’s Quick Service Restaurant Adventure",
      "video_description": "Uncle Paul is hungry and can't decide where to eat! He first chooses Emma's restaurant for some yummy giant corn. But when Emma takes a nap, Uncle Paul is left waiting forever! Luckily, Uncle Jason finds Wendy’s restaurant, where the food is ready in no time. Uncle Paul quickly switches to Wendy's, and everyone learns an important lesson: good service makes a big difference!\n\nLesson Highlight\nThe video teaches kids that being quick and attentive is just as important as making delicious food. Good service keeps customers happy!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-31T11:00:37",
      "video_thumbnail_url": "https://i.ytimg.com/vi/bLSCWoD8spU/maxresdefault.jpg",
      "video_view_count": 12126571,
      "video_like_count": 255587
    }
  ],
  "popular_videos": [
    {
      "video_id": "IVqKLxp6R4U",
      "video_title": "Going To The Dentist Song | Alex Pretend Play Sing-Along to Nursery Rhymes Kids Songs",
      "video_description": "Sing-along to the Going to the Dentist song with Alex and his family! This fun nursery rhyme song for kids will show them why it’s important to eat healthier food, brush your teeth, and visit the dentist.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-05-13T12:00:15Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/IVqKLxp6R4U/default.jpg",
      "video_view_count": 1132436141,
      "video_like_count": 2358784
    },
    {
      "video_id": "BNTCpF_n6J4",
      "video_title": "ABC Song | Wendy Pretend Play Learning Alphabet w/ Toys & Nursery Rhyme Songs",
      "video_description": "Wendy and Lyndon pretend play learning their ABCs with toys and nursery rhyme song. Wendy is playing with her alphabet toys and suddenly they start disappearing! She runs around looking for the ABC toys. With the help of her Auntie and Uncles she was able to find all of her ABC letters! After she finished finding all of the letters she teaches the alphabet to us with her friend Lyndon! They match the letters to an animal.",
      "video_published_at": "2018-11-04T13:00:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/BNTCpF_n6J4/default.jpg",
      "video_view_count": 1093099959,
      "video_like_count": 2585291
    },
    {
      "video_id": "Cz0xKTwF-rM",
      "video_title": "Johny Johny Yes Papa | Emma Pretend Play Wash Your Hands Before Eating Gumballs Kids Song",
      "video_description": "Emma pretend play wash your hands before she eats gumball candies to the Johny Johny Yes Papa nursery rhymes kids song. Do you remember to wash your hands after playing with toys, paint, sand? \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\nEnjoy more fun pretend play kids videos:\nIce Cream Drive Thru https://youtu.be/srRnCuwhdfQ\nMusic Toys & Kids Songs https://youtu.be/uR-fTBs1tUI\nKitchen & Food Truck https://youtu.be/g8eqq8EluqM\nABC Nursery Rhymes Song https://youtu.be/BNTCpF_n6J4\nJohny Johny Song https://youtu.be/8KWps11l45g\nHalloween Candy Haul https://youtu.be/a27Q0LlNZSk\nGiant Swimming Pool Water Slide https://youtu.be/NEZ59NtGpoc\nLOCKED UP Jail Playhouse https://youtu.be/kMkEaqC-214\nBabysitting Baby Dolls https://youtu.be/IGmgy_zaUiA\nPrincess Makeup & Dress Up https://youtu.be/QzIUBQvN7to",
      "video_published_at": "2019-04-17T12:00:01Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Cz0xKTwF-rM/default.jpg",
      "video_view_count": 836339433,
      "video_like_count": 1734457
    },
    {
      "video_id": "C3lLwQjrLXg",
      "video_title": "Ellie's Eco Adventure: Cleaning Up and Recycling Fun #shorts",
      "video_description": "Join young Ellie on her exciting journey as she discovers the joy of cleaning up and recycling. Watch as she learns how these eco-friendly practices can be both cool and fun! Ellie's enthusiasm is contagious, inspiring others to be more responsible with waste. Don't miss the grand finale where Ellie showcases her creativity, crafting a fantastic soda can train using recycled soda cans. This heartwarming video teaches children valuable lessons about sustainability and taking care of the environment while sparking their imagination.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-04-14T11:30:07Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/C3lLwQjrLXg/default.jpg",
      "video_view_count": 820142398,
      "video_like_count": 11594293
    },
    {
      "video_id": "CnSylwYOu1E",
      "video_title": "Ellie's Ice Cream Adventure: A Lesson in Line Etiquette! 🍦😊🍨👫 #shorts",
      "video_description": "Ellie tries to get ahead by cutting the line at her favorite ice cream store. 🏃‍♀️ She's craving cookie dough ice cream and can't wait to get her hands on it. Uncle Todd wants the same delicious treat. 🍨\n\nWatch as the store owner Charlotte whips up their tasty ice cream with a thumbs up. 🍦👍 Ellie's excitement is through the roof as she's ready to dig in! 😁\n\nBut wait! 😱 Charlotte doesn't hand the ice cream to Ellie! Instead, she gives it to Uncle Todd. 😔 Ellie is heartbroken, but she learns an important lesson about not cutting in line. 🚫\n\nWith her newfound knowledge, Ellie heads to the back of the line, and everyone gives her a thumbs up for learning her lesson. 👏👍\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-05-05T11:30:04Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/CnSylwYOu1E/default.jpg",
      "video_view_count": 628746935,
      "video_like_count": 9385310
    },
    {
      "video_id": "4XlXOLBthLA",
      "video_title": "Ellie Learns to Wait Her Turn",
      "video_description": "Ellie, excited about the game, shoots the slingshot and hits the target. As her friends wait for their turn, Ellie grows impatient and jumps ahead in the line, upsetting everyone.\n\nThe other kids express their frustration, telling Ellie that her behavior was unfair. Realizing her mistake after seeing her friends' anger, Ellie feels sad and excluded. Fortunately, Eric comes to talk to her, explaining the importance of apologizing for her actions. Ellie listens and apologizes to the group, who graciously accept her apology. The video ends with everyone taking turns with the slingshot, including Ellie, showing the importance of patience, fairness, and saying sorry.\n\nLesson Learned\nThe key lesson in this video is about the importance of patience, respecting others' turns, and the power of an apology. It teaches children that while it's natural to feel excited and impatient, it's crucial to be fair and considerate to others. When mistakes are made, apologizing sincerely can help mend friendships and restore harmony.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-12-09T12:30:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/4XlXOLBthLA/default.jpg",
      "video_view_count": 617275566,
      "video_like_count": 8542342
    },
    {
      "video_id": "wPGYtnv4HSY",
      "video_title": "Alex and Eric Pretend Play Pizza Drive Thru Restaurant | Funny Food Toys Story",
      "video_description": "Eric is running a pretend play pizza drive thru and Alex is craving some yummy pizza! Watch to see what happens in this funny story for kids about food toys. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-05-25T12:00:41Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/wPGYtnv4HSY/default.jpg",
      "video_view_count": 582124023,
      "video_like_count": 1282786
    },
    {
      "video_id": "KyuYLZ0HBig",
      "video_title": "Maddie and Charlotte Play with Colors and Painting Adventure",
      "video_description": "Maddie is caught painting on the wall by her Uncl!. As she's told to clean up Charlotte is also caught drawing on the floor in her room! Both kids feel disheartened, but Uncle comes to the rescue. He presents them with a delightful cardboard princess they can paint on. As they joyfully color the princess, Uncle gently reminds them about the appropriate places to paint. The day ends with smiles, art, and lessons learned about respecting the home.\n\nLesson Learned:\nIt's important to respect our surroundings and find appropriate places for our creativity.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-08-19T11:30:07Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/KyuYLZ0HBig/default.jpg",
      "video_view_count": 543062011,
      "video_like_count": 6528586
    },
    {
      "video_id": "t5EVv7t59oc",
      "video_title": "Learning to Share: Maddie and Charlotte's Sharing is Caring Story",
      "video_description": "Maddie is fully engaged in a game of car wash, but she prefers to play alone, leaving her friend Charlotte feeling left out. Maddie's day continues as she takes a snack break and snacks on some delicious fruits from a vending machine, but once again, she refuses to share with Charlotte, leaving her friend disappointed.\n\nSeeing this, Uncle steps in and reminds Maddie about the importance of sharing, but Maddie ignores his advice and keeps enjoying her fruits and toys all by herself. But soon, Maddie experiences a twist of fate; both her vending machine and car wash toys break down. Maddie is left feeling sad and confused, and it is at this moment Charlotte steps in with a helping hand. She fixes both the vending machine and car wash toys, showing Maddie the power of sharing and kindness.\n\nBefore Charlotte leaves, Maddie apologizes for her earlier behavior and invites Charlotte to play with her and share her fruits. They both enjoy the fruits and toys, learning that sharing really is caring, leaving Uncle smiling at this positive turn of events. In the end, they all laugh together, having learned a valuable lesson.\n\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-06-02T11:30:18Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/t5EVv7t59oc/default.jpg",
      "video_view_count": 507135741,
      "video_like_count": 7651562
    },
    {
      "video_id": "a27Q0LlNZSk",
      "video_title": "Emma Jannie & Wendy Pretend Play Halloween Trick Or Treat Costume Dress Up for Candy Haul",
      "video_description": "Emma, Jannie, Wendy, and Lyndon pretend play Halloween trick or treating for huge candy haul! Emma wakes up everybody to get costumes to go trick or treating. They try out a bunch of different costumes to find out which one is the best. Jannie is Aurora, Emma is Elsa, Wendy is a witch, and Lyndon is a giant pumpkin. First they go to Uncle Tim’s house, but it was super spooky and scary! Uncle Tim was dressed up as a clown and gave them some candy! After that they went over to Auntie’s house. Auntie dressed up as Maleficent and decorated her house with webs and bats. Lastly they went to Uncle K’s house, but he didn’t decorate his house or candy because the stores sold out! However, they head over to Uncle John’s store and he still had a bunch of Halloween stuff. They buy decorations to help Uncle K’s house look cool and spooky.",
      "video_published_at": "2018-10-25T11:58:28Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/a27Q0LlNZSk/default.jpg",
      "video_view_count": 478874630,
      "video_like_count": 1108155
    },
    {
      "video_id": "7HhdN9_MgE8",
      "video_title": "The Dentist Song | Jannie Pretend Play Nursery Rhymes Sing-Along Kids Songs",
      "video_description": "Sing-along to the Dentist song with Jannie! It’s a fun pretend play nursery rhymes sing-along song for kids! \n\nLyrics:\nCome on, come on, Let’s go.\nTo see the dentist.\nYou will feel better.\nHe is going to help.\nThe dentist is your friend.\nHe is not scary.\nBoys and girls \nCome on. Let’s see the dentist.\nGirls and boys.\nCome on. Let’s see the dentist.\nBoys and girls \nCome on. Let’s see the dentist now.\nCome on, come on. Let’s go.\nTo see the dentist.\nI want to have nice teeth, white and shining.\nYour teeth are going to grow, nice and shining.\nThe dentist is your friend.\nHe is not scary.\nBoys and girls \nCome on. Let’s see the dentist.\nGirls and boys.\nCome on. Let’s see the dentist.\nBoys and girls \nCome on. Let’s see the dentist now.\nCome on, come on, Let’s go.\nTo see the dentist.\nYou will feel better.\nHe is going to help.\nThe dentist is your friend.\nHe is not scary.\nBoys and girls \nCome on. Let’s see the dentist.\nGirls and boys.\nCome on. Let’s see the dentist.\nBoys and girls \nCome on. Let’s see the dentist now.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-11-07T13:00:01Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/7HhdN9_MgE8/default.jpg",
      "video_view_count": 461670573,
      "video_like_count": 793421
    },
    {
      "video_id": "srRnCuwhdfQ",
      "video_title": "Wendy Pretend Play with ICE CREAM Drive Thru Toy Store",
      "video_description": "Wendy pretend plays with her ice cream drive thru toy store! She is selling all kinds of different ice cream toys. Auntie arrives and orders a banana split with extra toppings. The baby doll also wants some ice cream and Auntie orders more. Uncle John has a hotdog store, but he has no customers! He has an idea to make an ice cream store to compete with Wendy! Auntie runs over to Uncle John’s ice cream cart store to buy some ice cream. Oh no! Uncle John doesn’t have any ice cream toys, but he only has the cones. So, he puts in hotdogs instead of ice cream and serves it to Auntie. Auntie didn’t like the hotdog ice cream, so she goes back to Wendy’s store and buys a popsicle toy. Uncle John is super sad that nobody is buying his ice cream. Wendy tells him he needs ice cream instead of hotdogs in his ice cream cone. She takes him to the toy store and they buy some ice cream toys. They go back and Wendy shows him how to make some ice cream and goes back to her store. Uncle John made a the ice cream cone wrong for Auntie and Wendy hires him to make ice cream at her shop to train him.",
      "video_published_at": "2018-06-25T12:00:03Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/srRnCuwhdfQ/default.jpg",
      "video_view_count": 457453754,
      "video_like_count": 1256992
    },
    {
      "video_id": "UspZIrwaP1M",
      "video_title": "Ellie's Coin Jar A Lesson on Saving Money #shorts",
      "video_description": "Ellie, starts with a jar full of coins she's saved up. With her eyes filled with glee, she spends all her coins on a mountain of candies. After multiple scenes of her trading coins for candies, Ellie ends up with an empty jar and a heavy heart.\n\nThen enters Auntie, who, with a kind heart and wisdom, advises Ellie on the importance of saving money. Inspired by Auntie's advice, Ellie decides to work hard to fill her jar again. She helps Uncle fix a toy car, and in gratitude, he gifts her some coins. She then assists Auntie in cleaning up the kitchen, and earns a few more coins for her efforts. Our story ends on a high note with Ellie carefully depositing her earned coins back into the jar, as she learns a valuable lesson on money management and saving.\n\nLesson Learned:\nThis video teaches children the value of saving money and that hard work pays off. It emphasizes the idea that instead of spending money impulsively, it's wiser to save it for future use, while also learning to earn money through small jobs.\n\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-06-16T11:30:12Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/UspZIrwaP1M/default.jpg",
      "video_view_count": 457862341,
      "video_like_count": 7899064
    },
    {
      "video_id": "9E3W-S5NH4E",
      "video_title": "Emma Pretend Play with Colorful Gumball Machine and Sweets Candy Toys for Kids",
      "video_description": "Emma loves play with her ne colorful gumball machine toy for kids! They have a bunch of sweets inside and she has to trade her old toys for it. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-11-11T13:00:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/9E3W-S5NH4E/default.jpg",
      "video_view_count": 445783015,
      "video_like_count": 713390
    },
    {
      "video_id": "G67QlGPFjGY",
      "video_title": "The Ultimate Color Battle: Maddie's Black World vs Charlotte's Pink World!",
      "video_description": "Maddie and Charlotte explore the worlds of black and pink! Watch as the two friends discover the fun of transforming sticky notes, playing with slime, and decorating cakes in their favorite colors. From using mysterious hands to help them out to combining their creative powers, Maddie and Charlotte show that sometimes, the best results come from working together and embracing both sides of the color spectrum.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-05-19T11:30:04Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/G67QlGPFjGY/default.jpg",
      "video_view_count": 417445452,
      "video_like_count": 6736074
    },
    {
      "video_id": "bALOuTBDj8Q",
      "video_title": "Learn Colors with Fruits Song | Wendy Nursery Rhymes & Kids Songs",
      "video_description": "Learn your colors with the Fruits song! Wendy and her friend Alex and Liam singing along to the fun and catchy songs that helps kids learn fruit names and colors. \n\nLyrics:\nThis is red, color red, red, red red\nThis is red, color red, red, red red\nDo you know what colors it is?\nIt is red. \n\nThis is red, color red, red, red red\nThis is red, color red, red, red red\nDo you know what colors it is?\nIt is red. \n\nThis is yellow, color yellow, yellow, yellow\nThis is yellow, color yellow, yellow, yellow\nDo you know what colors it is?\nIt is yellow.\n\nThis is orange, color orange, orange, orange\nThis is orange, color orange, orange, orange\nDo you know what colors it is?\nIt is orange.\n\nThis is green, color green, green, green\nThis is green, color green, green, green\nDo you know what colors it is?\nIt is green.\n\nThis is blue, color blue, blue, blue\nThis is blue, color blue, blue, blue\nDo you know what colors it is?\nIt is blue.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-07-15T00:00:04Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/bALOuTBDj8Q/default.jpg",
      "video_view_count": 407221631,
      "video_like_count": 1216985
    },
    {
      "video_id": "2wwKoI09mNQ",
      "video_title": "Wendy and Alex Pretend Play as Grownup Adults | Funny Children Stories",
      "video_description": "Wendy and Alex want to do things that grownups do, but learn that it is more fun to be a kid!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-03-12T12:00:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/2wwKoI09mNQ/default.jpg",
      "video_view_count": 400074494,
      "video_like_count": 995655
    },
    {
      "video_id": "7hFQC3nmm2c",
      "video_title": "Johny Johny Yes Papa Song | Wendy Wash Hand & Brush Teeth Nursery Rhymes Songs",
      "video_description": "New Johny Johny Yes Papa song where Wendy helping kids learn how to wash your hands and brush your teeth to fun nursery rhymes songs. Wendy really wants to eat french fries, but Uncle John tells her to wash her hands before eating. Wendy also teaches toddler Liam to wash his hands and brush his teeth before eating and after finish playing. Do you wash your hands often?",
      "video_published_at": "2019-02-12T13:00:03Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/7hFQC3nmm2c/default.jpg",
      "video_view_count": 361443766,
      "video_like_count": 1108419
    },
    {
      "video_id": "kigQ0QHZgzM",
      "video_title": "Put On Your Shoes Song  Wendy Pretend Play Morning Routine Brush Teeth Nursery Rhymes Kids Songs",
      "video_description": "Wendy pretend play to the Put on Your Shoes song! Uncle K wakes her up and makes her do her morning routine before going to school.\n\nLyrics:\n\nGo brush your teeth\nYour teeth \nYour teeth\nGo brush your teeth \nYour teeth \nYour teeth\nGo brush your teeth\nIt’s time for school! \nLet’s go \nLet’s go \nLet’s go! \n\nWhere are your shoes? \nYour shoes \nYour shoes \nLook for your shoes \nYour shoes \nYour shoes \nWear your shoes \nIt’s time for school! \nLet’s go \nLet’s go \nLet’s go! \n\nWhere is your jacket \nYour jacket \nYour jacket\nLook for your jacket\nYour jacket \nYour jacket \nWear your jacket \nIt’s time for school!\nLet’s go \nLet’s go \nLet’s go! \n\nWhere is your backpack \nYour backpack \nYour backpack\nLook for your backpack \nYour backpack \nYour backpack \nWear your backpack \nIt’s time for school!\nLet’s go \nLet’s go \nLet’s go! \n\nWhere is your homework? \nYour homework \nYour homework?\nLook for your homework \nYour homework \nYour homework \nGo get your homework \nIt’s time for school!\nLet’s go \nLet’s go \nLet’s go! \n\nYou brushed your teeth \nPut on your shoes \nPut on your jacket \nPut on your backpack \nYou have your homework \nIt’s time for school! \nLet’s go \nLet’s go\nLet’s go!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-06-04T12:00:09Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/kigQ0QHZgzM/default.jpg",
      "video_view_count": 350690145,
      "video_like_count": 776449
    },
    {
      "video_id": "PV6biSsmS80",
      "video_title": "Jobs Career & Professions Song | Wendy & Friends Pretend Play Nursery Rhymes Kids Songs",
      "video_description": "Wendy, Alex, and Liam pretend play sing to the Jobs Career and Professions song! This fun nursery rhymes for children will help kids decide what they want to be when they grow up. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-06-10T12:00:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/PV6biSsmS80/default.jpg",
      "video_view_count": 349375701,
      "video_like_count": 979831
    },
    {
      "video_id": "x2pNAWSZKiY",
      "video_title": "Superheroes Surprise Egg Song | Jannie Sing-Along Nursery Rhymes Song for Kids",
      "video_description": "Jannie sing-alongs to the Superheroes Surprise Egg Nursery Rhymes song for kids! Jannie gets the help from all of the superheroes with her surprise egg toys. There's Hulk, Spiderman, Ironman, and Captain America to help protect everything from Thanos.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-08-24T12:00:12Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/x2pNAWSZKiY/default.jpg",
      "video_view_count": 339268490,
      "video_like_count": 554413
    },
    {
      "video_id": "hM9JISUvX48",
      "video_title": "Sisterly Love: Play and Learn with Ellie and Charlotte",
      "video_description": "Charlotte helps her little sister Ellie in everyday tasks, making each moment joyful and educational. From feeding her at lunchtime with playful spoon games to fixing a broken toy with a touch of creativity, their day is filled with laughter and learning. They dive into the world of imagination while playing with bright toys, and tackle homework together with big sister's smart tips, turning challenges into fun activities. As the day winds down, they share a cozy moment brushing their teeth and then snuggle up for a magical bedtime story under the twinkling stars. This delightful song celebrates the joys of sisterhood and the beautiful way siblings can help and learn from each other. It's a heartwarming reminder of the magic of family and the joys of growing up together.\n\nLesson Learned:\nThe key lesson from this story is the importance of helping and caring for each other. It showcases how older siblings can be role models and teachers, making everyday tasks enjoyable and educational, and how these shared experiences strengthen the bond between siblings.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-03-08T12:30:32Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/hM9JISUvX48/default.jpg",
      "video_view_count": 304633070,
      "video_like_count": 3702359
    },
    {
      "video_id": "1K4T_Ea0h8U",
      "video_title": "Ellie's Broken Doll House Mystery with Eric!",
      "video_description": "Ellie's doll house gets broken. Ellie, surprised and upset, discovers Eric playing soccer nearby and suspects him. She suggests using a lie detector to find out the truth. Eric initially denies breaking the doll house, but the lie detector reveals he's not telling the truth. Caught, Eric admits he accidentally hit the doll house while playing soccer but also reveals that he fixed it immediately. The lie detector confirms Eric's honesty this time.\n\nJust as things seem to be resolved, Uncle enters the scene with another accidental hit to the doll house with a soccer ball. He takes responsibility and promises to fix it. Both Eric and Ellie join in to help repair the doll house. The story concludes with a humorous twist as Uncle, while putting away the soccer ball, accidentally drops it, hinting at more unintended chaos.\n\nLesson Learned\nThe key lesson from this video is the importance of honesty and taking responsibility for one's actions. Eric learns that it's better to admit a mistake and fix it than to deny it. Ellie learns not to jump to conclusions and blame others without knowing the whole story. Together, they learn about teamwork and fixing problems cooperatively.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-12-01T12:45:00Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/1K4T_Ea0h8U/default.jpg",
      "video_view_count": 296345998,
      "video_like_count": 4729872
    },
    {
      "video_id": "t74G4L6Ob8Q",
      "video_title": "Superhero Baby Shark Song | Emma Pretend Play Nursery Rhymes Song for Kids",
      "video_description": "Emma and her friend Alex pretend plays to the Superhero Baby Shark song for kids. On their children adventure they catch Thanos doing stuff that is wrong and take him to pretend play jail!\n\nLyrics:\nPink Batgirl do do do do do do\nPink Batgirl do do do do do do\nPink Batgirl do do do do do do \nPink Batgirl\n\nIncredible Hulk do do do do do do \nIncredible Hulk do do do do do do \nIncredible Hulk do do do do do do \nIncredible Hulk!\n\nLady Bug do do do do do do \nLady Bug do do do do do do \nLady Bug do do do do do do \nLady Bug! \n\nIron Man do do do do do do \nIron Man do do do do do do\nIron Man do do do do do do\nIron Man! \n\nSupergirl do do do do do do \nSupergirl do do do do do do\nSupergirl do do do do do do\nSupergirl!\n\nAnt Man do do do do do do\nAnt Man do do do do do do\nAnt Man do do do do do do\nAnt Man! \n\nSpider Gwen do do do do do do\nSpider Gwen do do do do do do\nSpider Gwen do do do do do do\nSpider Gwen! \n\nCaptain America do do do do do do \nCaptain America do do do do do do\nCaptain America do do do do do do\nCaptain America!\n\nWonder Woman do do do do do do \nWonder Woman do do do do do do\nWonder Woman do do do do do do \nWonder Woman!\n\nAvenger Thor do do do do do do \nAvenger Thor do do do do do do \nAvenger Thor do do do do do do \nAvenger Thor! \n\nBad Thanos do do do do do do \nBad Thanos do do do do do do \nBad Thanos do do do do do do \nBad Thanos!\n\nIt’s the end do do do do do do \nIt’s the end do do do do do do\nIt’s the end do do do do do do\nIt’s the end!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-07-22T12:00:14Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/t74G4L6Ob8Q/default.jpg",
      "video_view_count": 294299490,
      "video_like_count": 828390
    },
    {
      "video_id": "l35nWsEJlFY",
      "video_title": "Jannie Wants to Be a Good Sister for Ellie",
      "video_description": "Jannie pretend to play a fun story with Ellie about how to be a good sister. Jannie spends the whole day with Ellie and plays, eats, brushes their teeth, and has fun together. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n#jannie #toysandcolors #pretendplay",
      "video_published_at": "2021-05-15T12:00:15Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/l35nWsEJlFY/default.jpg",
      "video_view_count": 288393909,
      "video_like_count": 616554
    },
    {
      "video_id": "o0e1_rV_oms",
      "video_title": "This Is The Way Song | Wendy Pretend Play Morning School Routine Nursery Rhymes Song",
      "video_description": "How do you get ready for school in the morning? Have fun dancing and singing along to This Is The Way nursery rhymes song by Toys and Colors! \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\nEnjoy more fun pretend play kids videos:\nIce Cream Drive Thru https://youtu.be/srRnCuwhdfQ\nMusic Toys & Kids Songs https://youtu.be/uR-fTBs1tUI\nKitchen & Food Truck https://youtu.be/g8eqq8EluqM\nABC Nursery Rhymes Song https://youtu.be/BNTCpF_n6J4\nJohny Johny Song https://youtu.be/8KWps11l45g\nHalloween Candy Haul https://youtu.be/a27Q0LlNZSk\nGiant Swimming Pool Water Slide https://youtu.be/NEZ59NtGpoc\nLOCKED UP Jail Playhouse https://youtu.be/kMkEaqC-214\nBabysitting Baby Dolls https://youtu.be/IGmgy_zaUiA\nPrincess Makeup & Dress Up https://youtu.be/QzIUBQvN7to",
      "video_published_at": "2019-04-03T12:00:10Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/o0e1_rV_oms/default.jpg",
      "video_view_count": 286359571,
      "video_like_count": 700237
    },
    {
      "video_id": "NEZ59NtGpoc",
      "video_title": "Wendy Pretend Play with Giant Water Slide & Inflatable Swimming Pool Kid Toys for Girls",
      "video_description": "Wendy pretend play with giant water pool side and her Barbie cruise ship girl toys. Wendy loves slides and plays with a few at the playground park. They go home and Uncle K tells her to play in the kiddie pool while he is cleaning the backyard. She takes the Rapunzel and Elsa dolls with the cruise ship into the kiddie inflatable swimming pool. She lets them swim and go down the small slide. Uncle K is finally done cleaning up and takes Wendy to the big pool and giant water slide. Lyndon comes and joins the fun when they go play in the pool.",
      "video_published_at": "2018-08-20T12:00:04Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/NEZ59NtGpoc/default.jpg",
      "video_view_count": 278140835,
      "video_like_count": 431348
    },
    {
      "video_id": "Iv3IKdBIyJ0",
      "video_title": "Fun Rescue Missions with Police Ellie, Firefighter Charlotte, and Builder Beth",
      "video_description": "Mischief-maker Bad Guy Jim making a mess all around the house. However, Ellie is ready for action! She steps into the blue booth, transforming into a fearless police officer. With a swift swoop, she catches Jim, instructs him to clean up his mess, and gives him a time-out. Ellie is proud to be a police officer and claims, \"Police officers are the best. I am the best!\"\n\nSuddenly, the siren blares again, this time from the red booth! Uncle Roy's house is on fire, and he urgently needs help. This time, it's Charlotte's turn. She hops into the red booth and emerges as a brave firefighter. With her firefighter skills, she extinguishes the blaze, saving Uncle Roy's house. Overjoyed, Uncle Roy expresses his thanks, and Charlotte beams, declaring, \"Firefighters are the best!\"\n\nFinally, the siren echoes once more from the yellow booth. Uncle Roy's house, unfortunately, has been left damaged from the previous events. Auntie Beth is quick to respond, stepping into the yellow booth and transforming into a skilled builder. With patience and precision, she rebuilds Uncle Roy's house out of vibrant, fun Lego bricks. Auntie Beth concludes the adventure by stating, \"Construction workers are the best!\"\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-05-26T11:30:06Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Iv3IKdBIyJ0/default.jpg",
      "video_view_count": 275943103,
      "video_like_count": 4607517
    },
    {
      "video_id": "J72j6UwQl3o",
      "video_title": "Ellie's Big Oops and the Time-Out Adventure",
      "video_description": "Ellie, a young girl with a playful spirit and a knack for knocking things over. The fun begins when Ellie accidentally knocks down a vase with a ball. It shatters into pieces and in a quick attempt to avoid trouble, she blames it on the cat. Auntie, hearing the noise, comes into the room and gives the unsuspecting cat a time-out.\n\nLater, Ellie moves to the kitchen, where she ends up dropping her cereal bowl. Again, she blames it on the cat, but Auntie is quick to point out that the cat is in time-out and couldn't have caused the accident. Caught in her fib, Ellie goes to time-out.\n\nThe video concludes with Auntie teaching Ellie an important lesson about responsibility. Ellie learns that she must own up to her mistakes rather than blaming others. She apologizes, and Auntie lets her know that her time-out is over.\n\nLesson Learned:\nIt's essential to take responsibility for our actions and not blame others for our mistakes.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-06-30T11:30:05Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/J72j6UwQl3o/default.jpg",
      "video_view_count": 273974274,
      "video_like_count": 3807542
    },
    {
      "video_id": "IGmgy_zaUiA",
      "video_title": "Emma Pretend Play Babysitting Cry Baby Dolls w/ Nursery Playset Girl Toys",
      "video_description": "Emma pretend play babysitting her cry baby dolls with nursery playset girl toys. She tries to put her baby doll to sleep, but it doesn’t want to sleep. She sings the Brother John nursery rhyme lullaby, but the baby still doesn’t fall asleep. She uses the baby toy and the baby finally falls asleep. Suddenly, another baby wakes up and needs to be fed some milk. She puts the baby on the baby seat and feeds the baby doll. Uncle K comes and reminds her to finish her homework. While Emma finishes her homework the baby plays with some baby toys to keep busy. Uncle K takes Emma to the toy store to buy some food toys. She makes some baby food to eat and then puts it to sleep after the meal!",
      "video_published_at": "2018-08-16T12:00:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/IGmgy_zaUiA/default.jpg",
      "video_view_count": 273284441,
      "video_like_count": 466488
    },
    {
      "video_id": "wJUxUbRRe_Q",
      "video_title": "Jannie Learns to Play Piano w/ Wendy & Lyndon! Kids Start a Music Band",
      "video_description": "Jannie wants to learn how to play piano and asks Wendy to teach her. Jannie is late for her bus and asks Auntie to take her to Wendy’s music show. They go there and watch Wendy perform. Jannie and Auntie goes to the toy store to buy a piano so she can learn to play. Jannie and Auntie go home and play with the piano toy however they don’t know how to play with it. Wendy comes over and helps Jannie play piano. They all play together and Lyndon joins their band. They all sing and dance to nursery rhymes together!",
      "video_published_at": "2018-05-24T12:00:04Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/wJUxUbRRe_Q/default.jpg",
      "video_view_count": 270362509,
      "video_like_count": 838887
    },
    {
      "video_id": "Jddj8cthldw",
      "video_title": "Wendy Pretend Play Mixing Slimes & Fun Slime Challenge",
      "video_description": "Wendy and Uncle K pretend play mixing a lot of different slimes together and do a fun slime challenge! Do you like playing and mixing slimes?\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-08-05T12:00:02Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Jddj8cthldw/default.jpg",
      "video_view_count": 267817773,
      "video_like_count": 711177
    },
    {
      "video_id": "hkL41J0UQMM",
      "video_title": "Wendy Pretend Play with Giant Rainbow Inflatable Kids Swimming Pool",
      "video_description": "Wendy and her friends play with the giant inflatable kids swimming pool. They have fun splashing around, playing with the ball pit balls, and more!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-10-22T12:00:08Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/hkL41J0UQMM/default.jpg",
      "video_view_count": 236493604,
      "video_like_count": 325209
    },
    {
      "video_id": "ZC5AzBPlgJw",
      "video_title": "🎒👧👦 Backpack Buddies: Sharing is Caring! 🌟🤗 | #shorts",
      "video_description": "Join Charlotte and Ellie as they learn the importance of sharing and teamwork in this heartwarming YouTube Short! Watch these two adorable siblings take on the challenge of sharing a single backpack for school. Their journey is filled with laughter, learning, and the magic of cooperation. Don't miss out on the fun, and discover how Charlotte and Ellie become the ultimate Backpack Buddies! 💖✨ \n\n#BackpackBuddies #SharingIsCaring #ToysandColors\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-03-24T11:30:12Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ZC5AzBPlgJw/default.jpg",
      "video_view_count": 236191029,
      "video_like_count": 4004246
    },
    {
      "video_id": "rQGjOZC922o",
      "video_title": "Lets Go Shopping Song | Nursery Rhymes and Kids Songs",
      "video_description": "Emma, Jannie and Liam sing-along to the Lets Go Shopping song by Toys and Colors. They learn that it is nice to share their treats with their friends. This fun nursery rhymes song for kids about going shopping for chocolate will have them singing and dancing!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-03-04T13:00:09Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/rQGjOZC922o/default.jpg",
      "video_view_count": 232669261,
      "video_like_count": 488919
    },
    {
      "video_id": "8KWps11l45g",
      "video_title": "Johny Johny Yes Papa | Jannie & Wendy Pretend Play Wash Your Hands Nursery Rhymes Song",
      "video_description": "Jannie & Wendy pretend play wash your hands to the Johny Johny Yes Papa nursery rhymes song! Jannie is playing with her paint set and suddenly wants to eat some french fries. Uncle John reminds her to wash her hands before eating. Jannie goes over to her kinetic sand pit and plays with the sand. She comes back to the french fries and wants to eat some however she hasn’t washed her hands yet. Uncle John reminds her to go wash her hand before eating. Jannie goes to the bathroom and washes her hand with soap and water. Wendy arrives and plays with some play-doh toys with Jannie. They want to eat french fries so they go wash their hands before eating! Fun video to help kids learn about good hygiene!",
      "video_published_at": "2018-12-22T13:00:01Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/8KWps11l45g/default.jpg",
      "video_view_count": 232839976,
      "video_like_count": 622117
    },
    {
      "video_id": "IvC0F8AkjpY",
      "video_title": "Wendy Pretend Play with a Giant Inflatable Playhouse Swimming Pool Toy",
      "video_description": "Wendy and her friends pretend play with a giant inflatable playhouse in the swimming pool! What pool toys do you like to play with?\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2019-07-24T12:00:03Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/IvC0F8AkjpY/default.jpg",
      "video_view_count": 231436379,
      "video_like_count": 600898
    },
    {
      "video_id": "LTDFZlYWChA",
      "video_title": "Cosmic Cravings: Wendy's Quest for Uncle's Noodles #shorts",
      "video_description": "Wendy is on a quest to taste her Uncle's delicious noodles. However, she keeps asking her Uncle to go higher and higher, taking them on an exhilarating journey that reaches outer space! Just when they've reached the stars, Wendy asks if the noodles are spicy. Upon learning that they are, she changes her mind and decides she doesn't want to eat them anymore. Join Wendy and her Uncle as they embark on this exciting and whimsical journey.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-04-21T11:30:10Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/LTDFZlYWChA/default.jpg",
      "video_view_count": 224507127,
      "video_like_count": 3058118
    },
    {
      "video_id": "YnnY5NBPin8",
      "video_title": "Germs Beware! Ellie Learns to Wash Hands",
      "video_description": "Ellie learns about the crucial role of good hygiene in our daily life. It emphasizes the importance of washing hands, especially after playing with dirty toys or after sneezing, to prevent the spread of germs and stay healthy. By linking these actions to fun and relatable characters, kids are more likely to remember and practice these healthy habits.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-07-30T11:30:14Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/YnnY5NBPin8/default.jpg",
      "video_view_count": 224537525,
      "video_like_count": 3132899
    },
    {
      "video_id": "hXYhTBj-CzE",
      "video_title": "Maddie & Charlotte Tiny Heroes on a Big Mission! 🚒🚓🚧",
      "video_description": "Watch Maddie and Charlotte transform into mini police officers, firefighters, and builders in this heartwarming YouTube Shorts! 🌟 Join these tiny heroes as they help people in their neighborhood, making a big difference with their bravery and teamwork. 🚒🚓🚧 Get ready to be inspired by their adorable adventures and learn about the importance of these professions. Don't forget to like, share, and subscribe for more fun videos! 💕 \n\n#TinyHeroes #MaddieAndCharlotte #KidsRoleplay\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-03-31T11:30:24Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/hXYhTBj-CzE/default.jpg",
      "video_view_count": 223290682,
      "video_like_count": 3387807
    },
    {
      "video_id": "HU7daeoid5o",
      "video_title": "Emma & Wendy Pretend Play with Musical Instrument Toys for Kids & Sing Nursery Rhymes",
      "video_description": "Emma & Wendy pretend play with musical instruments and start their own band to sing nursery rhyme songs! Wendy has a cool keyboard and Emma has a drum. Wendy decided to play with Emma’s drum, but accidentally broke it. Wendy took the toy to the toy fixer to fix it. Emma thought Wendy took her drum and followed her. Wendy felt bad, so they all went to the toy store to buy Emma a new drum. The toy seller didn’t have any drums in stock, but instead had a cool microphone and Disney Frozen ukulele. The toy seller went to his storage to see if he still had a drum set for Emma. Emma, Wendy, and the Uncle Tim sang the nursery rhyme Johny Johny Yes Papa (Emma Wendy version) together. They went back home and played their toy instruments together. The band sang Rain Rain Go Away, The ABC Alphabet song, and Old MacDonald Had a Farm!",
      "video_published_at": "2018-06-03T12:00:01Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/HU7daeoid5o/default.jpg",
      "video_view_count": 219852651,
      "video_like_count": 525458
    },
    {
      "video_id": "9-ZNdSoRVDk",
      "video_title": "Emma Pretend Play w/ Luggage Suitcase Scooter Ride On Toy",
      "video_description": "Emma pretend play with a luggage and suitcase that is also a scooter ride on toy. Emma gets a luggage scooter at the toy store to help carry her musical instrument toys and to get to places faster. Uncle K shows her how to ride on it and also how to brake. They go to the talent show and sing nursery rhymes kid songs with their musical instrument toys.",
      "video_published_at": "2019-02-16T13:00:01Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/9-ZNdSoRVDk/default.jpg",
      "video_view_count": 218737686,
      "video_like_count": 509338
    },
    {
      "video_id": "dYiyGUUSdgk",
      "video_title": "Jannie Pretend Play Baking with Happy Birthday Day Cake & Kitchen Toys",
      "video_description": "Jannie pretend play baking with her happy birthday cake toy and kitchen toys! Jannie is late for the bus that takes her to Auntie’s birthday party. Uncle K takes her on his wagon, but Jannie accidentally dropped the cake. They go to the cake store to bake another cake for Auntie. After they are done, Uncle K drops her off at Auntie’s place. Jannie gifts Auntie the birthday cake toy as a cute birthday present. Auntie is so impressed by Jannie’s cute birthday cake, so she goes to the toy store and buys her a birthday cake store. Jannie and Auntie work together and make a bunch of birthday cakes with the kitchen toys!",
      "video_published_at": "2018-07-23T12:00:03Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/dYiyGUUSdgk/default.jpg",
      "video_view_count": 209212463,
      "video_like_count": 543400
    },
    {
      "video_id": "KKny3I7n0YY",
      "video_title": "Jannie and Ellie Pretend Play Real Pizza Drive Thru Food Toys Restaurant",
      "video_description": "Jannie and Ellie open a real pizza drive thru restaurant with their toys. They have a fun time pretend playing selling pizza to their customers in the drive thru line.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n#jannie #pizza #pretendcooking",
      "video_published_at": "2021-05-29T12:00:06Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/KKny3I7n0YY/default.jpg",
      "video_view_count": 207365465,
      "video_like_count": 384377
    },
    {
      "video_id": "6tVRZ7E3dwk",
      "video_title": "Maddie and Charlotte Learns Library Rules and Manners",
      "video_description": "Maddie's phone rings loudly in the quiet library, prompting Uncle Jim to gently remind her again about the rules. Maddie apologizes and turns off her phone. Feeling hungry, Maddie snacks on some chips, but soon learns that eating in the library is against the rules too. With Uncle Jim's patient guidance, Maddie learns the importance of following rules in shared spaces. By the end, Maddie is peacefully reading a book, respects the library's quiet atmosphere, and leaves with a smile and a valuable lesson. This episode teaches the importance of respecting shared spaces and following the rules, as they are in place for the benefit of everyone.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2023-08-13T11:30:05Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/6tVRZ7E3dwk/default.jpg",
      "video_view_count": 205847341,
      "video_like_count": 3139505
    },
    {
      "video_id": "kMkEaqC-214",
      "video_title": "Emma Pretend Play as Cop LOCKED UP Jannie in Jail Playhouse Toy for Kids",
      "video_description": "Emma pretend play as a cop and pretends to put people in her jail playhouse toy for kids. Jannie threw her trash bag outside in a no littering zone, so she had to go to jail. After that, Auntie Joyce was picking flowers at a garden that didn’t allow people to remove flowers. Uncle K was fishing in a no fishing zone and had to go to the jail playhouse for a few minutes. Lastly, Emma helped Uncle John find his toy birthday cake that he lost.",
      "video_published_at": "2018-11-21T01:30:00Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/kMkEaqC-214/default.jpg",
      "video_view_count": 200462428,
      "video_like_count": 380384
    },
    {
      "video_id": "6jNmvt96ekU",
      "video_title": "Wendy and Alex Make a Mess and Clean Up with Cleaning Toys for Kids",
      "video_description": "Wendy and Alex keep making a mess and have to clean up with fun cleaning toys!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-03-18T12:00:00Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/6jNmvt96ekU/default.jpg",
      "video_view_count": 198041123,
      "video_like_count": 484655
    },
    {
      "video_id": "NFUivBelIAA",
      "video_title": "Wendy Pretend Play w/ Hello Kitty Kitchen &Tea Party Kids Food Toys",
      "video_description": "Wendy pretend play with her new Hello Kitty kitchen playset and has a tea party! Wendy and Auntie Joyce is preparing food and drinks for their tea party, but suddenly the toy doesn’t work anymore. Auntie Joyce brings it to Uncle John the toy fixer and he fixes it for her. They prepare a bunch of food such as cake, fruits, cupcakes, pies, tea, and more for the party! They also have fun singing and dancing the bingo song.",
      "video_published_at": "2018-12-10T13:00:03Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/NFUivBelIAA/default.jpg",
      "video_view_count": 197378479,
      "video_like_count": 318719
    },
    {
      "video_id": "oHGWViRL1VI",
      "video_title": "Emma Pretend Play w/ Cute Pink Kitchen Restaurant Toy Cooking Food Kids Playset",
      "video_description": "Emma pretend play with her cute pink kitchen restaurant toy. She cooks pretend food kids toy at her new restaurant kitchen. Uncle K gave Emma the new kitchen toy and chef’s costume to wear. They pretend play selling and making food at a pretend restaurant. Uncle K takes Emma to Uncle John’s toy store and buys her a lot of pretend food toys for the restaurant. Emma cooks French fries, taco, fruits and veggies, spaghetti, eggs, bread, sandwich, burgers, and pizza toy!",
      "video_published_at": "2018-08-26T12:00:06Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/oHGWViRL1VI/default.jpg",
      "video_view_count": 194191544,
      "video_like_count": 392345
    },
    {
      "video_id": "DkarTDILJKE",
      "video_title": "Wendy Sing-Along Kids Songs & Nursery Rhymes",
      "video_description": "Sing-along to this cute nursery rhymes songs with Wendy and her family. A fun song for kids to dance and sing to. Can you help Wendy find who took the gumballs?\n\nLyrics:\nSomeone stole the gumball from the gumball machine\nSomeone stole the gumball from the gumball machine\nWho was it?\nI don’t know!\n\nLet’s go, let’s go, let’s go, and find out!\n\nWho stole the gumball from the gumball machine?\nWho stole the gumball from the gumball machine?\n\nWho stole the gumball from the gumball machine?\nYou stole the gumball from the gumball machine?\nWho me?\nYes you! Not me!\nThen who?\n\nWho stole the gumball from the gumball machine?\nWho stole the gumball from the gumball machine?\n\nWho stole the gumball from the gumball machine?\nYou stole the gumball from the gumball machine?\nWho me?\nYes you! Not me!\nThen who?\n\nWho stole the gumball from the gumball machine?\nWho stole the gumball from the gumball machine?\n\nYou stole the gumball from the gumball machine?\nYes, I know you stole the gumball from the gumball machine?\nWho me?\nYes you! Ok!\nIt was me!\n\nYou stole the gumball from the gumball machine?\nYes, you stole the gumball from the gumball machine?\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2020-08-08T12:00:04Z",
      "video_thumbnail_url": "https://i.ytimg.com/vi/DkarTDILJKE/default.jpg",
      "video_view_count": 189338506,
      "video_like_count": 234308
    }
  ],
  "short_videos": [
    {
      "video_id": "2uPySDValdE",
      "video_title": "Pirate Ben Learns to Share in the Pool with Andrea & Bobby!",
      "video_description": "Pirate Ben is making big splashes in the pool, bothering Andrea and Bobby! When Ben refuses to stop, Lifeguard Luke puts him in time-out. After time-out, Ben tries to split the pool unfairly, but Lifeguard Luke steps in again. Finally, Andrea and Bobby show kindness by giving Ben the best float, teaching him an important lesson about sharing. Watch how the kids learn that sharing and kindness make pool time more fun for everyone!\n\nLesson Highlight:\nThe lesson in this video is about the importance of sharing and being kind to others, showing that everyone has more fun when they play together and share.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-28T11:00:04",
      "video_thumbnail_url": "https://i.ytimg.com/vi/2uPySDValdE/maxresdefault.jpg",
      "video_view_count": 450235,
      "video_like_count": 9706
    },
    {
      "video_id": "clOad2aGA40",
      "video_title": "Playground Safety Rules: Wendy & Eric’s Park Adventure!",
      "video_description": "Eric and Wendy learn how to play safely by following playground rules, keeping a safe distance, staying hydrated, and washing away germs after having fun. Watch as they enjoy swinging, sliding, running around, and remembering important lessons like checking the slide, drinking water, and washing their hands. Safety and health come first, and with Uncle Jim’s help, Eric and Wendy give a big thumbs up for following the rules!\n\nLesson Highlight: Playing safely means paying attention to the rules, staying hydrated, and keeping your hands clean. It's fun to stay safe!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-26T11:00:44",
      "video_thumbnail_url": "https://i.ytimg.com/vi/clOad2aGA40/maxresdefault.jpg",
      "video_view_count": 778339,
      "video_like_count": 17094
    },
    {
      "video_id": "ceC6o7-YFDE",
      "video_title": "Maddie and Ben’s Park Surprise Adventure: Flying Kites and Ducks!",
      "video_description": "Maddie and Ben are super excited to play at the park, enjoying the see-saw, swing, and slide! But when Uncle Luke closes the park for maintenance, they feel disappointed. Luckily, Uncle Jim comes to the rescue by taking them to Harveston Park! At first, Maddie and Ben think the new park is boring with no slides or swings, but then they discover the fun of flying kites and meeting ducks! They learn that every place has its own special surprises—you just need to give it a chance!\n\nLesson Learned: Sometimes new places can be even more fun than you expect when you explore new things!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-24T11:00:45",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ceC6o7-YFDE/maxresdefault.jpg",
      "video_view_count": 4425149,
      "video_like_count": 78963
    },
    {
      "video_id": "fqpHBLQhUpk",
      "video_title": "Jannie Breaks Charlotte's Lego – But They Fix It Together!",
      "video_description": "Jannie accidentally breaks Charlotte's special Lego project and feels really bad. Instead of keeping it a secret, Jannie decides to be honest and tells Charlotte what happened. Together, they learn the power of teamwork as they rebuild the project with Uncle's help. The lesson? When you work together and tell the truth, you can fix anything!\n\nLesson: Honesty and teamwork can solve even the toughest problems!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-22T11:00:55",
      "video_thumbnail_url": "https://i.ytimg.com/vi/fqpHBLQhUpk/maxresdefault.jpg",
      "video_view_count": 1845042,
      "video_like_count": 31763
    },
    {
      "video_id": "sXxJcNw9pcg",
      "video_title": "Wendy Learns the Best Swimmers Help Others!",
      "video_description": "Wendy is an amazing swimmer and loves showing off her cool skills with dives and cannonballs! Eva is super impressed and asks Wendy to teach her how to swim, but Wendy is too busy. When Uncle Jim points out that the best swimmers also help others, Wendy realizes what she needs to do! She decides to teach Eva how to swim, and they have a splashy fun time learning together. This video shows the importance of helping others and sharing what you know to be the best at something!\n\nLesson: Helping others makes you even better at the things you're good at!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-20T11:00:59",
      "video_thumbnail_url": "https://i.ytimg.com/vi/sXxJcNw9pcg/maxresdefault.jpg",
      "video_view_count": 2461147,
      "video_like_count": 55540
    },
    {
      "video_id": "Fj8fu9FNLuY",
      "video_title": "Wendy and Eva’s Playhouse Adventure: Sharing Makes Friends!",
      "video_description": "Wendy has a cool pool house but doesn’t want to share it with Eva. Feeling sad, Eva finds Uncle Jim, who invites her to play at his toy house instead. Eva has so much fun pretending to cook and sliding down the house! When Wendy sees Eva having fun, she wants to join but is too shy to ask. Eva kindly invites Wendy to play, and Wendy learns that sharing makes everything more fun! This heartwarming story teaches an important lesson about friendship and the joy of sharing.\n\nLesson Highlight: Sharing with friends makes playtime even better and more fun for everyone!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-18T11:00:29",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Fj8fu9FNLuY/maxresdefault.jpg",
      "video_view_count": 49651036,
      "video_like_count": 847772
    },
    {
      "video_id": "_gnHMptZyHw",
      "video_title": "No Snacks in the Pool – Ben and Bobby Learn Why!",
      "video_description": "Ben and Bobby are having a blast by the pool, but things get a little silly when they start messing with the pool rules! Lifeguard Luke tells them, \"No snacks in the pool,\" but Ben and Bobby decide to have some fun by changing the signs. Chaos ensues as they sneakily replace the rules with goofy ones! In the end, Lifeguard Luke gives them a time-out, and the boys learn an important lesson about following the rules and keeping the pool clean. It's all fun and games, but cleaning up isn’t as fun as it sounds!\n\nLesson Learned: Always follow the rules and keep your environment clean to have safe and fun adventures!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-14T11:00:39",
      "video_thumbnail_url": "https://i.ytimg.com/vi/_gnHMptZyHw/maxresdefault.jpg",
      "video_view_count": 2971521,
      "video_like_count": 44099
    },
    {
      "video_id": "07MWvJyaFSo",
      "video_title": "Jannie Eric & Charlotte Halloween Spooky Costume Contest with Bowser!",
      "video_description": "Mario Eric, Princess Peach Charlotte , Wednesday Jannie, and Bowser Uncle Luke are all dressed up for a fun Halloween Costume Contest! But when Bowser shows up and causes a mess, everyone is a bit nervous. Bowser apologizes for the chaos and, together with his friends, helps clean everything up. The contest continues with lots of laughs, and the lesson of the day is to always be kind and work together, no matter our differences!\n\nLesson Learned:\nEven when things go wrong, working together and being kind can make everything better!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-12T11:00:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/07MWvJyaFSo/maxresdefault.jpg",
      "video_view_count": 1971870,
      "video_like_count": 39225
    },
    {
      "video_id": "qRMoKdP12ZM",
      "video_title": "Ellie and Andrea Conquer the Big Slide and Be Brave!",
      "video_description": "Ellie and Andrea are having a blast at the park, sliding down all the different slides. But when it’s time to go on the BIG slide, Andrea feels scared! With a little encouragement from Uncle and Ellie, the two friends decide to face their fears together. Watch as they conquer the slide and discover how much fun it is to be brave! This video teaches a great lesson about facing your fears with the help of friends!\n\nLesson: Being brave is easier when you have a friend by your side, and it’s okay to be scared sometimes!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-06T11:15:05",
      "video_thumbnail_url": "https://i.ytimg.com/vi/qRMoKdP12ZM/maxresdefault.jpg",
      "video_view_count": 35757800,
      "video_like_count": 603547
    },
    {
      "video_id": "ys_m4cAc8fM",
      "video_title": "Family Fishing Camping Adventure with Andrea Ben & Bobby",
      "video_description": "Join Ben, Bobby, and Andrea on their fun camping adventure with Uncle Luke! Even though they can't stop looking at their phones, Uncle Luke has a better idea—let's go fishing! At first, it seems boring, but when a fish appears, the kids jump into action. Watch how Andrea catches the fish, and everyone enjoys a campfire meal! Discover how spending time with family is way more fun than staring at a screen.\n\nLesson Learned: Spending quality time with family and friends is way more fun than being glued to your phone!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-10-04T11:01:13",
      "video_thumbnail_url": "https://i.ytimg.com/vi/ys_m4cAc8fM/maxresdefault.jpg",
      "video_view_count": 110917378,
      "video_like_count": 1766215
    },
    {
      "video_id": "b05mP3XKkEc",
      "video_title": "Beetlejuice Ellie Magical Mess Cleanup Adventure",
      "video_description": "Andrea just finished cleaning her room, but when she tries to shove a giant inflatable toy into her closet, it causes a huge mess! Things get even wilder when Ellie, the magical trickster, appears to “help” after Andrea calls her name three times. But instead of cleaning, Ellie’s magic makes the mess fly all over the place! Will Andrea ever get her room tidy again? Find out what happens and learn the lesson of patience and doing things the right way!\n\nLesson Learned: Sometimes magic tricks don’t solve problems—patience and doing things right is always best!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-28T11:00:44",
      "video_thumbnail_url": "https://i.ytimg.com/vi/b05mP3XKkEc/maxresdefault.jpg",
      "video_view_count": 10119566,
      "video_like_count": 173624
    },
    {
      "video_id": "3jbRE3DqE6k",
      "video_title": "Eric’s Day Out: Loud Music and Learning to Share the Pool!",
      "video_description": "Eric’s pool day fun gets a little too wild! From splashing big waves to blasting loud music, Eric is causing all sorts of trouble at the pool. Lifeguard Jim puts Eric in a time out after he cuts in line and keeps ignoring the rules. But after learning how to be kind and respectful, Eric finds a fun way to enjoy the pool without disturbing anyone. The lesson? It’s important to be thoughtful of others while having fun!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-26T11:00:06",
      "video_thumbnail_url": "https://i.ytimg.com/vi/3jbRE3DqE6k/maxresdefault.jpg",
      "video_view_count": 53492995,
      "video_like_count": 891510
    },
    {
      "video_id": "AbXB2VyOhec",
      "video_title": "Andrea and Ellie Play Basketball in the Swimming Pool with a Mermaid!",
      "video_description": "Andrea and Ellie are having a blast playing basketball by the pool! When Mermaid Emma asks to join, they tell her it's a one-on-one game. But after the ball accidentally flies into the pool, Emma helps retrieve it, and Andrea and Ellie realize it's even more fun to play together! They apologize and invite Emma to join, and the three of them have a great time. The lesson? Including others can make games even more fun!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-22T12:00:14",
      "video_thumbnail_url": "https://i.ytimg.com/vi/AbXB2VyOhec/maxresdefault.jpg",
      "video_view_count": 11471194,
      "video_like_count": 228264
    },
    {
      "video_id": "0VNEy9L61i4",
      "video_title": "Andrea & Ellie’s Awesome Science and Friendship Day!",
      "video_description": "Uncle Paul shows Andrea and Ellie how to pop a balloon without popping it, and the magic of static electricity with pepper! But that’s not all – the fun continues with poolside basketball, where Mermaid Emma saves the day. The girls learn the importance of including friends and how sharing makes everything better. With a fishing trip that teaches kindness, friendship, and sharing, this video is packed with fun and valuable lessons!\n\nLesson Learned: Sharing and being kind to others not only makes us feel good but also strengthens our friendships. Including others and sharing what we have is always the right thing to do.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-20T23:30:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/0VNEy9L61i4/maxresdefault.jpg",
      "video_view_count": 107546124,
      "video_like_count": 1484568
    },
    {
      "video_id": "j4KneREsjoI",
      "video_title": "Maddie’s Special Gift for Ben’s Birthday!",
      "video_description": "Maddie wants to give Ben a birthday present but realizes she doesn’t have any money. Instead of giving up, she decides to make something special just for him! She spends time drawing a Pikachu painting, worried it won't be as cool as the other gifts. But when Ben sees the painting, he loves it more than anything else! This heartwarming story teaches us that the best gifts come from the heart, not from how much money we spend.\n\nLesson Learned: It's the thought and effort behind a gift that makes it special, not how expensive it is!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-14T11:00:49",
      "video_thumbnail_url": "https://i.ytimg.com/vi/j4KneREsjoI/maxresdefault.jpg",
      "video_view_count": 12876088,
      "video_like_count": 365309
    },
    {
      "video_id": "yx8Vtncko6A",
      "video_title": "Ben and Andrea’s Learn to Reuse Challenge in Class",
      "video_description": "Andrea learns a big lesson about not being wasteful in this fun classroom adventure! When she keeps throwing away her notebooks and pencils, Ben and Mr. Paul remind her that it's better to reuse things. Mr. Paul even shows Andrea how she can give her old books to the library to help others. By the end, Andrea promises to take better care of her supplies and share with those in need. A great reminder to be mindful and not waste what we have!\n\nLesson Learned: It's important to use things wisely and not be wasteful. Sharing old items like books can help others, and reusing school supplies is better for the environment!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-12T11:01:12",
      "video_thumbnail_url": "https://i.ytimg.com/vi/yx8Vtncko6A/maxresdefault.jpg",
      "video_view_count": 14215732,
      "video_like_count": 338292
    },
    {
      "video_id": "Iv5BiHtg5DI",
      "video_title": "Andrea's Big Catch: Pirates and Treasure!",
      "video_description": "Andrea is fishing when she reels in something surprising—a treasure chest! Pirates Ben and Jim claim it’s theirs, but Andrea isn’t ready to give it up. The pirates trap Andrea in her house and offer a swap, but they soon regret it when their new home has an unexpected guest—a shark! Andrea steps in to help catch the sharks, and in the end, everyone learns that sharing is better than fighting. A fun adventure with a lesson about sharing and teamwork!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-08T11:00:24",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Iv5BiHtg5DI/maxresdefault.jpg",
      "video_view_count": 15975633,
      "video_like_count": 303121
    },
    {
      "video_id": "aY7RdzFv2vQ",
      "video_title": "Andrea & Ben Big Lesson in Honesty & Teamwork",
      "video_description": "Andrea's fun day turns into a mess when Ben accidentally knocks down her cup pyramid and Jenga tower with a basketball! Scared to tell the truth, Ben hides, but Uncle Paul teaches him a valuable lesson about honesty. When Ben finally apologizes, Andrea forgives him, and together they rebuild everything. This story highlights the importance of telling the truth, saying sorry, and working together to fix mistakes. Watch as Andrea and Ben learn that honesty is always the best policy!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-09-06T11:00:01",
      "video_thumbnail_url": "https://i.ytimg.com/vi/aY7RdzFv2vQ/maxresdefault.jpg",
      "video_view_count": 11169857,
      "video_like_count": 225553
    },
    {
      "video_id": "bLSCWoD8spU",
      "video_title": "Emma’s Giant Food vs. Wendy’s Quick Service Restaurant Adventure",
      "video_description": "Uncle Paul is hungry and can't decide where to eat! He first chooses Emma's restaurant for some yummy giant corn. But when Emma takes a nap, Uncle Paul is left waiting forever! Luckily, Uncle Jason finds Wendy’s restaurant, where the food is ready in no time. Uncle Paul quickly switches to Wendy's, and everyone learns an important lesson: good service makes a big difference!\n\nLesson Highlight\nThe video teaches kids that being quick and attentive is just as important as making delicious food. Good service keeps customers happy!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-31T11:00:37",
      "video_thumbnail_url": "https://i.ytimg.com/vi/bLSCWoD8spU/maxresdefault.jpg",
      "video_view_count": 12126571,
      "video_like_count": 255588
    },
    {
      "video_id": "2Z0EC888ibE",
      "video_title": "Ellie and Andrea's Fishing Together Friends Forever!",
      "video_description": "Ellie and Andrea goes on a fun fishing adventure! Ellie is feeling down because she can't catch any fish, while Andrea has a full bucket. But when the roles are reversed, Ellie teaches Andrea the importance of sharing. Together, they learn that being a good friend means caring for each other, no matter what. Watch how sharing brings them closer and makes fishing even more fun!\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-25T11:30:02",
      "video_thumbnail_url": "https://i.ytimg.com/vi/2Z0EC888ibE/maxresdefault.jpg",
      "video_view_count": 30514668,
      "video_like_count": 650007
    },
    {
      "video_id": "_qLpS2Vfp3Y",
      "video_title": "Andrea Learns to Share Slime with Emma & Ben",
      "video_description": "Andrea is super excited about her new ducky slime, but when Emma and Ben ask to join in, she doesn't want to share. Feeling sad, Emma and Ben come up with a clever idea—they'll make their own slimes with extra special add-ins! With some help from a grown-up, they create amazing slimes using glitter and clay. When Andrea sees how cool their slimes are, she wishes hers could be just as awesome. But there's a catch—she'll need to apologize and share to make it happen!\n\nLesson Learned: Sharing is not only kind, but it also makes playtime even more fun and creative!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-17T11:00:36",
      "video_thumbnail_url": "https://i.ytimg.com/vi/_qLpS2Vfp3Y/maxresdefault.jpg",
      "video_view_count": 41098447,
      "video_like_count": 912307
    },
    {
      "video_id": "pRJvp2scL38",
      "video_title": "Andrea's Ice Cream Adventure: Clean Up Time!",
      "video_description": "Andrea loves playing outside and enjoying her favorite ice cream, but things get messy when she tries to do both at the same time! First, she makes a sticky mess on the slide, and then she drops her ice cream in the bouncy house. Emma and Ben aren't too happy, but Emma has a great idea! She teaches Andrea the importance of cleaning up and doing one thing at a time. After Andrea cleans up, she gets a yummy, healthy surprise—fruit popsicles made with Uncle’s help! The lesson? Clean up your mess and focus on one thing at a time for extra fun!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-15T11:00:47",
      "video_thumbnail_url": "https://i.ytimg.com/vi/pRJvp2scL38/maxresdefault.jpg",
      "video_view_count": 194906987,
      "video_like_count": 2797344
    },
    {
      "video_id": "kWQAU009KAo",
      "video_title": "Wendy and Emma Big Pool Race: Stay Hydrated & Win the Race!",
      "video_description": "Wendy and Emma have a fun pool day with Uncle Paul! Watch as they take turns cannonballing and practicing their swimming. When the big race comes, Wendy wins, and Emma learns an important lesson about staying hydrated. Discover why drinking water is super important for being your best!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-11T11:00:42",
      "video_thumbnail_url": "https://i.ytimg.com/vi/kWQAU009KAo/maxresdefault.jpg",
      "video_view_count": 31352512,
      "video_like_count": 484125
    },
    {
      "video_id": "maNmkql5t_I",
      "video_title": "🎺 Ben and Ellie’s Musical Friendship: Loud Musical Surprise Day",
      "video_description": "🎸 Ellie and Ben live in a fun two-story house! Ellie loves playing music, but her loud tunes are keeping Ben awake and making it hard for him to study. After asking Ellie to stop, she switches instruments, but it’s still too loud! Ben decides to leave, and Ellie soon realizes how much she misses him. She apologizes and invites Ben back, and together, they make beautiful music. This story teaches us the importance of being considerate and finding harmony with our friends! 🎶\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-09T11:00:54",
      "video_thumbnail_url": "https://i.ytimg.com/vi/maNmkql5t_I/maxresdefault.jpg",
      "video_view_count": 35362984,
      "video_like_count": 676195
    },
    {
      "video_id": "FFMUyMootVU",
      "video_title": "Ben & Ellie’s Bouncy House Dress-Up Game",
      "video_description": "Ben is having a blast in the bouncy house, but Ellie wants to join in the fun! Watch as Ellie tries different outfits to find the perfect bouncer-friendly look. From fancy dresses to pointy crowns, Ellie learns that sometimes the best outfit is the one that's safe for play. Join the fun and see Ellie’s final costume that lets her bounce around with Ben!\n\nLesson Learned:\nSafety comes first when choosing what to wear for different activities. Ellie discovers that while fancy clothes and accessories are fun, it's important to dress appropriately to join in safely.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-05T11:30:13",
      "video_thumbnail_url": "https://i.ytimg.com/vi/FFMUyMootVU/maxresdefault.jpg",
      "video_view_count": 10628099,
      "video_like_count": 216337
    },
    {
      "video_id": "VN6I4SX3wvk",
      "video_title": "No Phone Just Fun! Wendy & Emma's Swimming Challenge",
      "video_description": "Emma learns an important lesson about balancing screen time and outdoor fun! When Emma accidentally spills a glass of water while playing on her phone, Uncle Paul steps in to teach her a lesson. After some time out, Emma tries to play on a small laptop but is encouraged by Uncle Paul and Wendy to go swimming instead. At first reluctant, Emma ends up having a blast racing in the pool and discovering that outdoor activities are not only fun but also healthy! Join Emma, Uncle Paul, and Wendy as they show that there's more to life than screens!\n\nLesson Learned:\n\nThe video teaches kids the importance of balancing screen time with outdoor activities. It highlights how outdoor play can be both enjoyable and beneficial for their health.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-08-03T11:30:16",
      "video_thumbnail_url": "https://i.ytimg.com/vi/VN6I4SX3wvk/maxresdefault.jpg",
      "video_view_count": 26798950,
      "video_like_count": 484019
    },
    {
      "video_id": "wu67i205Woo",
      "video_title": "Ellie Learns to Try New Foods with Andrea!",
      "video_description": "Ellie is having fun playing games but starts feeling hungry. Uncle Paul lovingly makes her a delicious steak. However, Ellie says she doesn't like steak and isn't hungry anymore, making Uncle Paul sad. Andrea steps in and explains to Ellie that Uncle Paul worked hard to cook for her. Realizing her mistake, Ellie apologizes to Uncle Paul and tries the steak. To her surprise, it's so tasty! Ellie learns the importance of appreciating others' efforts and trying new things.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-28T11:00:49",
      "video_thumbnail_url": "https://i.ytimg.com/vi/wu67i205Woo/maxresdefault.jpg",
      "video_view_count": 28787260,
      "video_like_count": 427776
    },
    {
      "video_id": "6plBYfipn08",
      "video_title": "Ellie & Andrea Discovers Solar Energy Light Magic!",
      "video_description": "Ellie faces a sudden power outage while drawing! It's completely dark, but Uncle Paul saves the day with a magical solar light! 🌞✨ Watch as Uncle Paul explains the wonders of solar energy to curious Ellie and Andrea. Learn how solar energy can keep the lights on even when the power goes out. It's a fun adventure with a bright lesson on clean energy! 🌟🔆\n\nLesson Learned: Solar energy is a fantastic way to keep the lights on during a power outage. It’s clean, renewable, and helps us stay bright even when the power goes out.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-26T11:00:07",
      "video_thumbnail_url": "https://i.ytimg.com/vi/6plBYfipn08/maxresdefault.jpg",
      "video_view_count": 56579676,
      "video_like_count": 898190
    },
    {
      "video_id": "N131o-wcmv8",
      "video_title": "Ellie and Ben's Fun Slide Adventure & Helping Emma at the Restaurant!",
      "video_description": "Emma needs help setting up the restaurant, Ellie and Ben sneak away to keep playing on the slide. Emma ends up doing everything herself until a loud crash gets Ben and Ellie’s attention. Feeling sorry, they come back to help Emma finish the job, and soon they're all back to having fun on the slide. Watch this fun and exciting adventure to learn the importance of helping your friends!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-22T11:00:20",
      "video_thumbnail_url": "https://i.ytimg.com/vi/N131o-wcmv8/maxresdefault.jpg",
      "video_view_count": 23931097,
      "video_like_count": 395861
    },
    {
      "video_id": "yy6pyO9bMJ8",
      "video_title": "Ben Learns to Help Uncle Clean Up with Chores",
      "video_description": "Ben is super sleepy and doesn’t want to clean up, so Uncle takes on the chores. From washing clothes to watering plants, Uncle does it all and gets really tired. When Ben wakes up hungry, he sees how hard Uncle has been working. Feeling sorry, Ben jumps in to help with the cooking and cleaning! Together, they finish the chores and enjoy a tasty meal. Ben learns the importance of helping with chores and promises to help more in the future. Teamwork makes everything better!\n\nLesson Learned: Helping each other with chores makes the work easier and more fun, and it shows how much we care!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-20T11:00:56",
      "video_thumbnail_url": "https://i.ytimg.com/vi/yy6pyO9bMJ8/maxresdefault.jpg",
      "video_view_count": 5957494,
      "video_like_count": 112379
    },
    {
      "video_id": "fXg1HHu7ODo",
      "video_title": "Ellie vs Ben: Epic Swimming Pool Swim Challenge",
      "video_description": "🌊🏊‍♀️🏆 Ellie wins the first two races, but Uncle Paul announces a real competition for the next day. Confident Ellie thinks she'll win again, while Ben decides to train hard. Watch as Ben's dedication pays off and he wins the big race! This fun and friendly competition teaches us that hard work and practice can lead to great success. Ellie congratulates Ben and asks for another race. What a great sportsmanship! Don't miss out on the fun and the important lesson about perseverance and determination! 🌟\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-14T11:00:35",
      "video_thumbnail_url": "https://i.ytimg.com/vi/fXg1HHu7ODo/maxresdefault.jpg",
      "video_view_count": 11669262,
      "video_like_count": 200381
    },
    {
      "video_id": "dwmft9fAZCc",
      "video_title": "Andrea Ben & Ellie’s Pool Party Mystery Adventure! 🌊🏠",
      "video_description": "Ellie finds a fun new way to play with the pool inside the house! But Uncle Paul isn't too happy about pools popping up in unexpected places. From sneaky snacks to hilarious surprises, join Ellie, Ben, and Andrea as they learn why pools belong outside. Uncle Paul teaches everyone a valuable lesson about having fun the right way. Dive into this splashy adventure and see how Ellie’s clever idea saves the day!\n\nLesson Learned: Pools are for outside fun, and playing by the rules keeps everyone happy!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-12T11:00:43",
      "video_thumbnail_url": "https://i.ytimg.com/vi/dwmft9fAZCc/maxresdefault.jpg",
      "video_view_count": 35434569,
      "video_like_count": 699996
    },
    {
      "video_id": "7acPDJGg4NU",
      "video_title": "Ellie's Cannonball Big Splash in the Pool with Ben & Andrea!",
      "video_description": "Ellie makes a huge cannonball splash into the pool, but uh-oh! The splash ruins Ben’s ice cream and Andrea’s drink! Uncle Paul steps in and gives everyone a time out to teach an important lesson: no eating or drinking in the pool! Watch as Ben and Andrea learn the pool rules the hard way, and see why it’s important to follow them. Fun and lessons all in one splashy adventure!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-06T11:15:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/7acPDJGg4NU/maxresdefault.jpg",
      "video_view_count": 323344159,
      "video_like_count": 4437287
    },
    {
      "video_id": "0GheKnQRe2Y",
      "video_title": "Giant Egg Cooking Fun with Ellie and Charlotte: Sharing is Caring!",
      "video_description": "🎉 Ellie is cooking giant eggs, but when Charlotte asks to share, Ellie says no. Charlotte walks away sadly. Then, Ellie accidentally drops her egg and feels really sad. She goes to buy more eggs, but the store is out! Ellie bumps into Charlotte, who kindly shares her only egg with Ellie. Ellie learns the importance of sharing and says sorry to Charlotte. They both enjoy cooking eggs together! 🥚❤️\n\nLesson Learned: Sharing makes everyone happy, and friends always help each other!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-07-04T11:15:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/0GheKnQRe2Y/maxresdefault.jpg",
      "video_view_count": 69982621,
      "video_like_count": 1324513
    },
    {
      "video_id": "XL7HNpQOV5w",
      "video_title": "Reading vs. Playing: Turtles' Fun Day with Eric & Jannie",
      "video_description": "Turtle Eric surprises Turtle Jannie and Turtle Auntie by bursting into the room! They’re so startled! Eric invites them to play outside, but Jannie is busy reading her mountain of books 📚, and Auntie is taking a nap 😴.\n\nWatch as funny panda eyes appear on Jannie from all that reading! Auntie is bored and peeks out the window to see Eric having a blast with his friend Horse 🐴. He's riding a carriage, and it looks like so much fun! Auntie and Jannie can’t resist and decide to join in.\n\nJoin the turtles for a day filled with fun and laughter! 😄 Remember: Sometimes it's important to take a break and have fun with friends! 🎉\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-30T11:00:29",
      "video_thumbnail_url": "https://i.ytimg.com/vi/XL7HNpQOV5w/maxresdefault.jpg",
      "video_view_count": 5900734,
      "video_like_count": 109131
    },
    {
      "video_id": "rfqMILyiWOk",
      "video_title": "Eric & Jannie Learn Teamwork with Dominoes!",
      "video_description": "Jannie and Eric are having a blast with dominoes! Jannie shows off her skills, making a cool domino track. Eric wants to try too, but he keeps messing up and gets really frustrated. He decides to quit, but Jannie encourages him to try again. With a little teamwork and a lot of laughs, they rebuild the domino track and finally get it to work. Watch how Eric learns the importance of patience and persistence. Fun and laughter all the way!\n\nLesson Learned:\n\nSometimes things don't go as planned, but with patience, teamwork, and a positive attitude, you can achieve great things and have fun along the way!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-28T11:01:00",
      "video_thumbnail_url": "https://i.ytimg.com/vi/rfqMILyiWOk/maxresdefault.jpg",
      "video_view_count": 28105142,
      "video_like_count": 429047
    },
    {
      "video_id": "kI_Hh4HNCCA",
      "video_title": "Eric's Car Wash Fun Day! 🚙💧",
      "video_description": "Join Eric on a fun adventure as he visits Uncle Jim's car wash. But wait! Uncle Jim keeps asking for more money! 😱 Eric is not happy and decides to go to Paul's car wash instead. Paul washes the car by hand and takes great care of it. In the end, Uncle Jim learns a valuable lesson about treating customers fairly. Watch to find out more! 🌟\n\nLesson Learned: It's important to be fair and honest with others, especially when running a business!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-22T11:00:42",
      "video_thumbnail_url": "https://i.ytimg.com/vi/kI_Hh4HNCCA/maxresdefault.jpg",
      "video_view_count": 73026546,
      "video_like_count": 1232794
    },
    {
      "video_id": "Wk0xXDBptJY",
      "video_title": "Kaden's Rickshaw vs Eric's Car Race to School!",
      "video_description": "Join Kaden and Uncle Jim on their exciting ride to school! 🚴‍♂️ But wait, Eric thinks his cool car is the best and he's sure he'll get there first. 🚗💨 He even stops for a car wash to make his car sparkle! Will Eric's flashy ride make it on time, or will Kaden and Uncle Jim's simple rickshaw beat him to school? Find out in this fun and hilarious adventure! 😂 Lesson learned: Sometimes being simple and steady wins the race! 🏆\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-20T11:00:34",
      "video_thumbnail_url": "https://i.ytimg.com/vi/Wk0xXDBptJY/maxresdefault.jpg",
      "video_view_count": 34144325,
      "video_like_count": 685763
    },
    {
      "video_id": "UyQngRkN0KA",
      "video_title": "Ellie’s Superhero Plushies Come to Life! Ellie Learns to Share",
      "video_description": "Ellie is having a fun time with her Spiderman and Pikachu plushies. But when Eric wants to join, Ellie says no, leaving Eric sad. Suddenly, Spiderman and Pikachu come to life! What starts as an exciting adventure quickly turns into a chaotic mess. Ellie finds herself tangled in Spiderman's webs and zapped by Pikachu's electric shock. But it’s all just a dream! Ellie learns the importance of sharing and says sorry to Eric. Watch and see the fun and the lesson Ellie learns!\n\nLesson Learned:\nSharing with friends can lead to more fun and less trouble!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-16T11:00:22",
      "video_thumbnail_url": "https://i.ytimg.com/vi/UyQngRkN0KA/maxresdefault.jpg",
      "video_view_count": 91853594,
      "video_like_count": 1532490
    },
    {
      "video_id": "2Dgvf-h3cYo",
      "video_title": "Ellie’s Big Kindness Adventure: The Search for Warmth and Food!",
      "video_description": "Brrrr! Ellie is feeling so cold and needs a cozy place to stay. She asks Uncle Paul, but his place is too small. Then, Ellie meets Uncle Roy, but he doesn't share his food. Finally, Ellie finds Charlotte, who warmly welcomes her and cooks a big meal just for Ellie. Join Ellie on her fun adventure and learn the importance of kindness and sharing. Watch how a little warmth and a big heart make everything better!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-14T11:00:02",
      "video_thumbnail_url": "https://i.ytimg.com/vi/2Dgvf-h3cYo/maxresdefault.jpg",
      "video_view_count": 45172735,
      "video_like_count": 910754
    },
    {
      "video_id": "kHwwQ4ecpR8",
      "video_title": "Eric No Cutting in Line! Jannie Teaches Him to Wait His Turn",
      "video_description": "Eric is super hungry and decides to cut the line to order first, making everyone upset. Jannie calmly handles the situation, serving everyone in the correct order. Eric learns an important lesson about patience and fairness. Watch the fun unfold and remember, cutting the line isn't cool! 🌟\n\nLesson Learned: Always wait your turn and respect others!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-08T11:00:48",
      "video_thumbnail_url": "https://i.ytimg.com/vi/kHwwQ4ecpR8/maxresdefault.jpg",
      "video_view_count": 16813945,
      "video_like_count": 310756
    },
    {
      "video_id": "vSWVqP3dtbo",
      "video_title": "Police Barbie Jannie vs Bowser Eric: Time Out Adventure",
      "video_description": "🎨 Oh no! Bowser Eric gets into trouble when he uses silly string to mess up a beautiful painting! 🚨 But don't worry, Barbie Jannie is here with her trusty stop sign to save the day! She teaches Bowser Eric a valuable lesson about making things right. After a quick time-out, Bowser fixes the painting, and Jannie gives a big thumbs up! 👍\n\n🤑 Suddenly, a monster appears and tries to steal money from Eric! Jannie steps in just in time to stop the monster and teaches it an important lesson about not taking things without permission. She takes the monster to jail for a 10-minute time-out. Good job, Jannie! 🚔\n\nLesson Learned: Always fix your mistakes and never take things without permission!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-06T11:00:50",
      "video_thumbnail_url": "https://i.ytimg.com/vi/vSWVqP3dtbo/maxresdefault.jpg",
      "video_view_count": 31069457,
      "video_like_count": 486699
    },
    {
      "video_id": "AK-xbM4IaWY",
      "video_title": "Eric Reveals First Look of Ryan’s World the Movie: Titan Universe Adventure",
      "video_description": "Eric introduces the official trailer for \"Ryan’s World the Movie: Titan Universe Adventure,\" hitting theaters on August 16th! Get ready for action, fun, and surprises!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-04T11:00:16",
      "video_thumbnail_url": "https://i.ytimg.com/vi/AK-xbM4IaWY/maxresdefault.jpg",
      "video_view_count": 4686828,
      "video_like_count": 108227
    },
    {
      "video_id": "jz18VYaQP5k",
      "video_title": "Eric & Ellie Trapped in a Ball Pit Maze with a Dragon!",
      "video_description": "Eric and Ellie get trapped in a maze box filled with ball pits, trash, and foam! They must find hidden keys to escape each room. Along the way, they meet a lonely dragon who locked them up because he wanted friends. Eric and Ellie forgive the dragon and become friends, ending the adventure with a fun dance party! The lesson learned is the importance of forgiveness and making new friends.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-06-02T11:00:38",
      "video_thumbnail_url": "https://i.ytimg.com/vi/jz18VYaQP5k/maxresdefault.jpg",
      "video_view_count": 6369761,
      "video_like_count": 131252
    },
    {
      "video_id": "dOzc3s43Y5s",
      "video_title": "Wendy & Eva Learns to Ask for Help Snack Time Adventure!",
      "video_description": "Eva wants a snack but needs to wash her hands first. She can't reach the faucet and pretends she washed them. In the pantry, she can't reach the cereal either and tries to build steps with foam and jumbo Lego blocks. Wendy, distracted by music, finally notices and stops Eva from climbing, explaining it's dangerous and reminding her to ask for help. Wendy realizes she wasn't paying attention and apologizes. They both learn to be more careful and helpful. Eva gets her snack safely with Wendy's help.\n\nLesson Learned\nAlways ask for help when you need it and avoid dangerous climbing. Paying attention to each other is important to stay safe.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-05-31T11:00:38",
      "video_thumbnail_url": "https://i.ytimg.com/vi/dOzc3s43Y5s/maxresdefault.jpg",
      "video_view_count": 97337538,
      "video_like_count": 1524764
    },
    {
      "video_id": "hRiHpEhNtss",
      "video_title": "Airport Fun Eva and Wendy Help Uncle Jim Luggage Problem!",
      "video_description": "Uncle Jim is at the airport, but his luggage is too heavy! Eva and Wendy help him figure out what’s making it so heavy. First, Uncle Jim eats all the oranges from his suitcase, but it’s still too heavy. Then, they find out he has too many water bottles, so Uncle Jim drinks them all, but it’s still heavy! Finally, Uncle Jim puts on a bunch of clothes from his luggage and removes stickers, and they check again. After all that effort, he’s finally ready to go! The lesson here is about not wasting things and being resourceful, even in funny situations.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-05-26T11:00:35",
      "video_thumbnail_url": "https://i.ytimg.com/vi/hRiHpEhNtss/maxresdefault.jpg",
      "video_view_count": 54141542,
      "video_like_count": 997959
    },
    {
      "video_id": "9yptCv1gy_M",
      "video_title": "Emma’s Adventure: Rescued by a LEGO Boat!",
      "video_description": "Emma is stuck on the couch and needs help. Uncle Jason tries to rescue her with a funny bike, but it almost sinks into lava, so he jumps out just in time! Next, he brings pillows for Emma to step on, but they start sinking too. Emma returns to the couch and sees the whole house sinking. Finally, Uncle Jason comes back with a LEGO boat and saves Emma just in time! The lesson learned is to stay calm and try different solutions when faced with a problem.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-05-23T11:00:12",
      "video_thumbnail_url": "https://i.ytimg.com/vi/9yptCv1gy_M/maxresdefault.jpg",
      "video_view_count": 73262137,
      "video_like_count": 1307994
    },
    {
      "video_id": "36p-AI5zyGU",
      "video_title": "Ellie Eric & Eva Rules at the Park: Slide Time Fun and Cleaning Up",
      "video_description": "Eric, Eva, and Ellie all want to be first to go down the slide, but they start fighting over it. Uncle Jason steps in and asks them to stop. Eric kindly lets Ellie go first, then Eva, and finally, he goes down the slide. After having fun at the park, the kids are very tired and Uncle Jason gives them some water to drink. When they finish, they all throw their bottles on the ground. Uncle Jason reminds them to clean up their trash, teaching them an important lesson about keeping the park clean.\n\nLesson Learned:\nThe video teaches kids the importance of taking turns, being considerate of others, and keeping their environment clean.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-05-19T11:00:02",
      "video_thumbnail_url": "https://i.ytimg.com/vi/36p-AI5zyGU/maxresdefault.jpg",
      "video_view_count": 46522904,
      "video_like_count": 753834
    },
    {
      "video_id": "f4A_KC_LZaE",
      "video_title": "Wendy and Maddie Silly Sand Playtime",
      "video_description": "Wendy is getting ready for a party when she discovers her shoes, bag, and even her game controller are mysteriously made of sand! It turns out, Maddie was behind the sand prank because she wanted Wendy to play with her. After a short time out, Wendy understands Maddie's feelings and invites her to the party, showing that friends should communicate and play together.\n\nLesson Learned: It's important to communicate with your friends about your feelings and include them in your fun activities!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-05-17T11:00:39",
      "video_thumbnail_url": "https://i.ytimg.com/vi/f4A_KC_LZaE/maxresdefault.jpg",
      "video_view_count": 14751885,
      "video_like_count": 359595
    },
    {
      "video_id": "mJxlPhscDXE",
      "video_title": "Ellie & Eric Learns to Be On Time!",
      "video_description": "Ellie learns a valuable lesson about the importance of being on time. After arriving late to class, Ellie faces disappointment as she fails a test and receives an F. Her day doesn't improve when she shows up late to soccer practice and realizes she forgot her socks. Feeling upset, Ellie receives help from her friend Eric, who gives her stickers and alarm clocks to better manage her time. Inspired, Ellie writes down her schedule, ensuring she wakes up early for school and soccer practice. With her new routine, Ellie not only aces her next test with an A+ but also arrives early to help Coach Beth and even scores a goal in soccer practice. It's a joyful turnaround as Ellie discovers how punctuality can lead to success and less stress!\n\nLesson Learned\nEllie learns that being punctual can greatly improve her academic performance, sports participation, and overall daily success, helping her feel more organized and less stressed.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "video_published_at": "2024-05-12T11:00:37",
      "video_thumbnail_url": "https://i.ytimg.com/vi/mJxlPhscDXE/maxresdefault.jpg",
      "video_view_count": 19453739,
      "video_like_count": 391994
    }
  ],
  "recommended_videos": [
    {
      "title": "Learn Colors with Fruits Song | Wendy Nursery Rhymes & Kids Songs",
      "description": "Learn your colors with the Fruits song! Wendy and her friend Alex and Liam singing along to the fun and catchy songs that helps kids learn fruit names and colors. \n\nLyrics:\nThis is red, color red, red, red red\nThis is red, color red, red, red red\nDo you know what colors it is?\nIt is red. \n\nThis is red, color red, red, red red\nThis is red, color red, red, red red\nDo you know what colors it is?\nIt is red. \n\nThis is yellow, color yellow, yellow, yellow\nThis is yellow, color yellow, yellow, yellow\nDo you know what colors it is?\nIt is yellow.\n\nThis is orange, color orange, orange, orange\nThis is orange, color orange, orange, orange\nDo you know what colors it is?\nIt is orange.\n\nThis is green, color green, green, green\nThis is green, color green, green, green\nDo you know what colors it is?\nIt is green.\n\nThis is blue, color blue, blue, blue\nThis is blue, color blue, blue, blue\nDo you know what colors it is?\nIt is blue.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-07-15T00:00:04Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/bALOuTBDj8Q/hqdefault.jpg",
      "videoId": "bALOuTBDj8Q",
      "viewCount": 407221631,
      "likeCount": 1216985
    },
    {
      "title": "🎒👧👦 Backpack Buddies: Sharing is Caring! 🌟🤗 | #shorts",
      "description": "Join Charlotte and Ellie as they learn the importance of sharing and teamwork in this heartwarming YouTube Short! Watch these two adorable siblings take on the challenge of sharing a single backpack for school. Their journey is filled with laughter, learning, and the magic of cooperation. Don't miss out on the fun, and discover how Charlotte and Ellie become the ultimate Backpack Buddies! 💖✨ \n\n#BackpackBuddies #SharingIsCaring #ToysandColors\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-03-24T11:30:12Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/ZC5AzBPlgJw/hqdefault.jpg",
      "videoId": "ZC5AzBPlgJw",
      "viewCount": 236191029,
      "likeCount": 4004253
    },
    {
      "title": "Ellie Learns to Wait Her Turn",
      "description": "Ellie, excited about the game, shoots the slingshot and hits the target. As her friends wait for their turn, Ellie grows impatient and jumps ahead in the line, upsetting everyone.\n\nThe other kids express their frustration, telling Ellie that her behavior was unfair. Realizing her mistake after seeing her friends' anger, Ellie feels sad and excluded. Fortunately, Eric comes to talk to her, explaining the importance of apologizing for her actions. Ellie listens and apologizes to the group, who graciously accept her apology. The video ends with everyone taking turns with the slingshot, including Ellie, showing the importance of patience, fairness, and saying sorry.\n\nLesson Learned\nThe key lesson in this video is about the importance of patience, respecting others' turns, and the power of an apology. It teaches children that while it's natural to feel excited and impatient, it's crucial to be fair and considerate to others. When mistakes are made, apologizing sincerely can help mend friendships and restore harmony.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-12-09T12:30:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/4XlXOLBthLA/hqdefault.jpg",
      "videoId": "4XlXOLBthLA",
      "viewCount": 617294923,
      "likeCount": 8542355
    },
    {
      "title": "Emma Pretend Play w/ Cute Pink Kitchen Restaurant Toy Cooking Food Kids Playset",
      "description": "Emma pretend play with her cute pink kitchen restaurant toy. She cooks pretend food kids toy at her new restaurant kitchen. Uncle K gave Emma the new kitchen toy and chef’s costume to wear. They pretend play selling and making food at a pretend restaurant. Uncle K takes Emma to Uncle John’s toy store and buys her a lot of pretend food toys for the restaurant. Emma cooks French fries, taco, fruits and veggies, spaghetti, eggs, bread, sandwich, burgers, and pizza toy!",
      "publishedAt": "2018-08-26T12:00:06Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/oHGWViRL1VI/hqdefault.jpg",
      "videoId": "oHGWViRL1VI",
      "viewCount": 194191544,
      "likeCount": 392345
    },
    {
      "title": "Emma Pretend Play Babysitting Cry Baby Dolls w/ Nursery Playset Girl Toys",
      "description": "Emma pretend play babysitting her cry baby dolls with nursery playset girl toys. She tries to put her baby doll to sleep, but it doesn’t want to sleep. She sings the Brother John nursery rhyme lullaby, but the baby still doesn’t fall asleep. She uses the baby toy and the baby finally falls asleep. Suddenly, another baby wakes up and needs to be fed some milk. She puts the baby on the baby seat and feeds the baby doll. Uncle K comes and reminds her to finish her homework. While Emma finishes her homework the baby plays with some baby toys to keep busy. Uncle K takes Emma to the toy store to buy some food toys. She makes some baby food to eat and then puts it to sleep after the meal!",
      "publishedAt": "2018-08-16T12:00:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/IGmgy_zaUiA/hqdefault.jpg",
      "videoId": "IGmgy_zaUiA",
      "viewCount": 273284441,
      "likeCount": 466488
    },
    {
      "title": "Ellie's Ice Cream Adventure: A Lesson in Line Etiquette! 🍦😊🍨👫 #shorts",
      "description": "Ellie tries to get ahead by cutting the line at her favorite ice cream store. 🏃‍♀️ She's craving cookie dough ice cream and can't wait to get her hands on it. Uncle Todd wants the same delicious treat. 🍨\n\nWatch as the store owner Charlotte whips up their tasty ice cream with a thumbs up. 🍦👍 Ellie's excitement is through the roof as she's ready to dig in! 😁\n\nBut wait! 😱 Charlotte doesn't hand the ice cream to Ellie! Instead, she gives it to Uncle Todd. 😔 Ellie is heartbroken, but she learns an important lesson about not cutting in line. 🚫\n\nWith her newfound knowledge, Ellie heads to the back of the line, and everyone gives her a thumbs up for learning her lesson. 👏👍\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-05-05T11:30:04Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/CnSylwYOu1E/hqdefault.jpg",
      "videoId": "CnSylwYOu1E",
      "viewCount": 628752618,
      "likeCount": 9385316
    },
    {
      "title": "The Dentist Song | Jannie Pretend Play Nursery Rhymes Sing-Along Kids Songs",
      "description": "Sing-along to the Dentist song with Jannie! It’s a fun pretend play nursery rhymes sing-along song for kids! \n\nLyrics:\nCome on, come on, Let’s go.\nTo see the dentist.\nYou will feel better.\nHe is going to help.\nThe dentist is your friend.\nHe is not scary.\nBoys and girls \nCome on. Let’s see the dentist.\nGirls and boys.\nCome on. Let’s see the dentist.\nBoys and girls \nCome on. Let’s see the dentist now.\nCome on, come on. Let’s go.\nTo see the dentist.\nI want to have nice teeth, white and shining.\nYour teeth are going to grow, nice and shining.\nThe dentist is your friend.\nHe is not scary.\nBoys and girls \nCome on. Let’s see the dentist.\nGirls and boys.\nCome on. Let’s see the dentist.\nBoys and girls \nCome on. Let’s see the dentist now.\nCome on, come on, Let’s go.\nTo see the dentist.\nYou will feel better.\nHe is going to help.\nThe dentist is your friend.\nHe is not scary.\nBoys and girls \nCome on. Let’s see the dentist.\nGirls and boys.\nCome on. Let’s see the dentist.\nBoys and girls \nCome on. Let’s see the dentist now.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-11-07T13:00:01Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/7HhdN9_MgE8/hqdefault.jpg",
      "videoId": "7HhdN9_MgE8",
      "viewCount": 461670573,
      "likeCount": 793421
    },
    {
      "title": "Wendy and Alex Make a Mess and Clean Up with Cleaning Toys for Kids",
      "description": "Wendy and Alex keep making a mess and have to clean up with fun cleaning toys!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-03-18T12:00:00Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/6jNmvt96ekU/hqdefault.jpg",
      "videoId": "6jNmvt96ekU",
      "viewCount": 198041123,
      "likeCount": 484655
    },
    {
      "title": "Maddie and Charlotte Play with Colors and Painting Adventure",
      "description": "Maddie is caught painting on the wall by her Uncl!. As she's told to clean up Charlotte is also caught drawing on the floor in her room! Both kids feel disheartened, but Uncle comes to the rescue. He presents them with a delightful cardboard princess they can paint on. As they joyfully color the princess, Uncle gently reminds them about the appropriate places to paint. The day ends with smiles, art, and lessons learned about respecting the home.\n\nLesson Learned:\nIt's important to respect our surroundings and find appropriate places for our creativity.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-08-19T11:30:07Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/KyuYLZ0HBig/hqdefault.jpg",
      "videoId": "KyuYLZ0HBig",
      "viewCount": 543062011,
      "likeCount": 6528595
    },
    {
      "title": "Johny Johny Yes Papa | Jannie & Wendy Pretend Play Wash Your Hands Nursery Rhymes Song",
      "description": "Jannie & Wendy pretend play wash your hands to the Johny Johny Yes Papa nursery rhymes song! Jannie is playing with her paint set and suddenly wants to eat some french fries. Uncle John reminds her to wash her hands before eating. Jannie goes over to her kinetic sand pit and plays with the sand. She comes back to the french fries and wants to eat some however she hasn’t washed her hands yet. Uncle John reminds her to go wash her hand before eating. Jannie goes to the bathroom and washes her hand with soap and water. Wendy arrives and plays with some play-doh toys with Jannie. They want to eat french fries so they go wash their hands before eating! Fun video to help kids learn about good hygiene!",
      "publishedAt": "2018-12-22T13:00:01Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/8KWps11l45g/hqdefault.jpg",
      "videoId": "8KWps11l45g",
      "viewCount": 232840403,
      "likeCount": 622117
    },
    {
      "title": "Ellie's Coin Jar A Lesson on Saving Money #shorts",
      "description": "Ellie, starts with a jar full of coins she's saved up. With her eyes filled with glee, she spends all her coins on a mountain of candies. After multiple scenes of her trading coins for candies, Ellie ends up with an empty jar and a heavy heart.\n\nThen enters Auntie, who, with a kind heart and wisdom, advises Ellie on the importance of saving money. Inspired by Auntie's advice, Ellie decides to work hard to fill her jar again. She helps Uncle fix a toy car, and in gratitude, he gifts her some coins. She then assists Auntie in cleaning up the kitchen, and earns a few more coins for her efforts. Our story ends on a high note with Ellie carefully depositing her earned coins back into the jar, as she learns a valuable lesson on money management and saving.\n\nLesson Learned:\nThis video teaches children the value of saving money and that hard work pays off. It emphasizes the idea that instead of spending money impulsively, it's wiser to save it for future use, while also learning to earn money through small jobs.\n\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-06-16T11:30:12Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/UspZIrwaP1M/hqdefault.jpg",
      "videoId": "UspZIrwaP1M",
      "viewCount": 457862341,
      "likeCount": 7899076
    },
    {
      "title": "Cosmic Cravings: Wendy's Quest for Uncle's Noodles #shorts",
      "description": "Wendy is on a quest to taste her Uncle's delicious noodles. However, she keeps asking her Uncle to go higher and higher, taking them on an exhilarating journey that reaches outer space! Just when they've reached the stars, Wendy asks if the noodles are spicy. Upon learning that they are, she changes her mind and decides she doesn't want to eat them anymore. Join Wendy and her Uncle as they embark on this exciting and whimsical journey.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-04-21T11:30:10Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/LTDFZlYWChA/hqdefault.jpg",
      "videoId": "LTDFZlYWChA",
      "viewCount": 224507127,
      "likeCount": 3058120
    },
    {
      "title": "Superheroes Surprise Egg Song | Jannie Sing-Along Nursery Rhymes Song for Kids",
      "description": "Jannie sing-alongs to the Superheroes Surprise Egg Nursery Rhymes song for kids! Jannie gets the help from all of the superheroes with her surprise egg toys. There's Hulk, Spiderman, Ironman, and Captain America to help protect everything from Thanos.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-08-24T12:00:12Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/x2pNAWSZKiY/hqdefault.jpg",
      "videoId": "x2pNAWSZKiY",
      "viewCount": 339268490,
      "likeCount": 554413
    },
    {
      "title": "Wendy Pretend Play with Giant Rainbow Inflatable Kids Swimming Pool",
      "description": "Wendy and her friends play with the giant inflatable kids swimming pool. They have fun splashing around, playing with the ball pit balls, and more!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-10-22T12:00:08Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/hkL41J0UQMM/hqdefault.jpg",
      "videoId": "hkL41J0UQMM",
      "viewCount": 236493604,
      "likeCount": 325209
    },
    {
      "title": "Ellie's Eco Adventure: Cleaning Up and Recycling Fun #shorts",
      "description": "Join young Ellie on her exciting journey as she discovers the joy of cleaning up and recycling. Watch as she learns how these eco-friendly practices can be both cool and fun! Ellie's enthusiasm is contagious, inspiring others to be more responsible with waste. Don't miss the grand finale where Ellie showcases her creativity, crafting a fantastic soda can train using recycled soda cans. This heartwarming video teaches children valuable lessons about sustainability and taking care of the environment while sparking their imagination.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-04-14T11:30:07Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/C3lLwQjrLXg/hqdefault.jpg",
      "videoId": "C3lLwQjrLXg",
      "viewCount": 820148452,
      "likeCount": 11594314
    },
    {
      "title": "Wendy Pretend Play with a Giant Inflatable Playhouse Swimming Pool Toy",
      "description": "Wendy and her friends pretend play with a giant inflatable playhouse in the swimming pool! What pool toys do you like to play with?\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-07-24T12:00:03Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/IvC0F8AkjpY/hqdefault.jpg",
      "videoId": "IvC0F8AkjpY",
      "viewCount": 231436379,
      "likeCount": 600898
    },
    {
      "title": "Emma Pretend Play as Cop LOCKED UP Jannie in Jail Playhouse Toy for Kids",
      "description": "Emma pretend play as a cop and pretends to put people in her jail playhouse toy for kids. Jannie threw her trash bag outside in a no littering zone, so she had to go to jail. After that, Auntie Joyce was picking flowers at a garden that didn’t allow people to remove flowers. Uncle K was fishing in a no fishing zone and had to go to the jail playhouse for a few minutes. Lastly, Emma helped Uncle John find his toy birthday cake that he lost.",
      "publishedAt": "2018-11-21T01:30:00Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/kMkEaqC-214/hqdefault.jpg",
      "videoId": "kMkEaqC-214",
      "viewCount": 200462743,
      "likeCount": 380384
    },
    {
      "title": "Jannie Learns to Play Piano w/ Wendy & Lyndon! Kids Start a Music Band",
      "description": "Jannie wants to learn how to play piano and asks Wendy to teach her. Jannie is late for her bus and asks Auntie to take her to Wendy’s music show. They go there and watch Wendy perform. Jannie and Auntie goes to the toy store to buy a piano so she can learn to play. Jannie and Auntie go home and play with the piano toy however they don’t know how to play with it. Wendy comes over and helps Jannie play piano. They all play together and Lyndon joins their band. They all sing and dance to nursery rhymes together!",
      "publishedAt": "2018-05-24T12:00:04Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/wJUxUbRRe_Q/hqdefault.jpg",
      "videoId": "wJUxUbRRe_Q",
      "viewCount": 270362509,
      "likeCount": 838887
    },
    {
      "title": "Sisterly Love: Play and Learn with Ellie and Charlotte",
      "description": "Charlotte helps her little sister Ellie in everyday tasks, making each moment joyful and educational. From feeding her at lunchtime with playful spoon games to fixing a broken toy with a touch of creativity, their day is filled with laughter and learning. They dive into the world of imagination while playing with bright toys, and tackle homework together with big sister's smart tips, turning challenges into fun activities. As the day winds down, they share a cozy moment brushing their teeth and then snuggle up for a magical bedtime story under the twinkling stars. This delightful song celebrates the joys of sisterhood and the beautiful way siblings can help and learn from each other. It's a heartwarming reminder of the magic of family and the joys of growing up together.\n\nLesson Learned:\nThe key lesson from this story is the importance of helping and caring for each other. It showcases how older siblings can be role models and teachers, making everyday tasks enjoyable and educational, and how these shared experiences strengthen the bond between siblings.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2024-03-08T12:30:32Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/hM9JISUvX48/hqdefault.jpg",
      "videoId": "hM9JISUvX48",
      "viewCount": 304633070,
      "likeCount": 3702373
    },
    {
      "title": "Wendy Sing-Along Kids Songs & Nursery Rhymes",
      "description": "Sing-along to this cute nursery rhymes songs with Wendy and her family. A fun song for kids to dance and sing to. Can you help Wendy find who took the gumballs?\n\nLyrics:\nSomeone stole the gumball from the gumball machine\nSomeone stole the gumball from the gumball machine\nWho was it?\nI don’t know!\n\nLet’s go, let’s go, let’s go, and find out!\n\nWho stole the gumball from the gumball machine?\nWho stole the gumball from the gumball machine?\n\nWho stole the gumball from the gumball machine?\nYou stole the gumball from the gumball machine?\nWho me?\nYes you! Not me!\nThen who?\n\nWho stole the gumball from the gumball machine?\nWho stole the gumball from the gumball machine?\n\nWho stole the gumball from the gumball machine?\nYou stole the gumball from the gumball machine?\nWho me?\nYes you! Not me!\nThen who?\n\nWho stole the gumball from the gumball machine?\nWho stole the gumball from the gumball machine?\n\nYou stole the gumball from the gumball machine?\nYes, I know you stole the gumball from the gumball machine?\nWho me?\nYes you! Ok!\nIt was me!\n\nYou stole the gumball from the gumball machine?\nYes, you stole the gumball from the gumball machine?\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-08-08T12:00:04Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/DkarTDILJKE/hqdefault.jpg",
      "videoId": "DkarTDILJKE",
      "viewCount": 189338506,
      "likeCount": 234308
    },
    {
      "title": "Johny Johny Yes Papa | Emma Pretend Play Wash Your Hands Before Eating Gumballs Kids Song",
      "description": "Emma pretend play wash your hands before she eats gumball candies to the Johny Johny Yes Papa nursery rhymes kids song. Do you remember to wash your hands after playing with toys, paint, sand? \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\nEnjoy more fun pretend play kids videos:\nIce Cream Drive Thru https://youtu.be/srRnCuwhdfQ\nMusic Toys & Kids Songs https://youtu.be/uR-fTBs1tUI\nKitchen & Food Truck https://youtu.be/g8eqq8EluqM\nABC Nursery Rhymes Song https://youtu.be/BNTCpF_n6J4\nJohny Johny Song https://youtu.be/8KWps11l45g\nHalloween Candy Haul https://youtu.be/a27Q0LlNZSk\nGiant Swimming Pool Water Slide https://youtu.be/NEZ59NtGpoc\nLOCKED UP Jail Playhouse https://youtu.be/kMkEaqC-214\nBabysitting Baby Dolls https://youtu.be/IGmgy_zaUiA\nPrincess Makeup & Dress Up https://youtu.be/QzIUBQvN7to",
      "publishedAt": "2019-04-17T12:00:01Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/Cz0xKTwF-rM/hqdefault.jpg",
      "videoId": "Cz0xKTwF-rM",
      "viewCount": 836339433,
      "likeCount": 1734457
    },
    {
      "title": "Superhero Baby Shark Song | Emma Pretend Play Nursery Rhymes Song for Kids",
      "description": "Emma and her friend Alex pretend plays to the Superhero Baby Shark song for kids. On their children adventure they catch Thanos doing stuff that is wrong and take him to pretend play jail!\n\nLyrics:\nPink Batgirl do do do do do do\nPink Batgirl do do do do do do\nPink Batgirl do do do do do do \nPink Batgirl\n\nIncredible Hulk do do do do do do \nIncredible Hulk do do do do do do \nIncredible Hulk do do do do do do \nIncredible Hulk!\n\nLady Bug do do do do do do \nLady Bug do do do do do do \nLady Bug do do do do do do \nLady Bug! \n\nIron Man do do do do do do \nIron Man do do do do do do\nIron Man do do do do do do\nIron Man! \n\nSupergirl do do do do do do \nSupergirl do do do do do do\nSupergirl do do do do do do\nSupergirl!\n\nAnt Man do do do do do do\nAnt Man do do do do do do\nAnt Man do do do do do do\nAnt Man! \n\nSpider Gwen do do do do do do\nSpider Gwen do do do do do do\nSpider Gwen do do do do do do\nSpider Gwen! \n\nCaptain America do do do do do do \nCaptain America do do do do do do\nCaptain America do do do do do do\nCaptain America!\n\nWonder Woman do do do do do do \nWonder Woman do do do do do do\nWonder Woman do do do do do do \nWonder Woman!\n\nAvenger Thor do do do do do do \nAvenger Thor do do do do do do \nAvenger Thor do do do do do do \nAvenger Thor! \n\nBad Thanos do do do do do do \nBad Thanos do do do do do do \nBad Thanos do do do do do do \nBad Thanos!\n\nIt’s the end do do do do do do \nIt’s the end do do do do do do\nIt’s the end do do do do do do\nIt’s the end!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-07-22T12:00:14Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/t74G4L6Ob8Q/hqdefault.jpg",
      "videoId": "t74G4L6Ob8Q",
      "viewCount": 294299490,
      "likeCount": 828390
    },
    {
      "title": "Jannie and Ellie Pretend Play Real Pizza Drive Thru Food Toys Restaurant",
      "description": "Jannie and Ellie open a real pizza drive thru restaurant with their toys. They have a fun time pretend playing selling pizza to their customers in the drive thru line.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n#jannie #pizza #pretendcooking",
      "publishedAt": "2021-05-29T12:00:06Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/KKny3I7n0YY/hqdefault.jpg",
      "videoId": "KKny3I7n0YY",
      "viewCount": 207365465,
      "likeCount": 384377
    },
    {
      "title": "Emma Pretend Play with Colorful Gumball Machine and Sweets Candy Toys for Kids",
      "description": "Emma loves play with her ne colorful gumball machine toy for kids! They have a bunch of sweets inside and she has to trade her old toys for it. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-11-11T13:00:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/9E3W-S5NH4E/hqdefault.jpg",
      "videoId": "9E3W-S5NH4E",
      "viewCount": 445783015,
      "likeCount": 713390
    },
    {
      "title": "This Is The Way Song | Wendy Pretend Play Morning School Routine Nursery Rhymes Song",
      "description": "How do you get ready for school in the morning? Have fun dancing and singing along to This Is The Way nursery rhymes song by Toys and Colors! \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\nEnjoy more fun pretend play kids videos:\nIce Cream Drive Thru https://youtu.be/srRnCuwhdfQ\nMusic Toys & Kids Songs https://youtu.be/uR-fTBs1tUI\nKitchen & Food Truck https://youtu.be/g8eqq8EluqM\nABC Nursery Rhymes Song https://youtu.be/BNTCpF_n6J4\nJohny Johny Song https://youtu.be/8KWps11l45g\nHalloween Candy Haul https://youtu.be/a27Q0LlNZSk\nGiant Swimming Pool Water Slide https://youtu.be/NEZ59NtGpoc\nLOCKED UP Jail Playhouse https://youtu.be/kMkEaqC-214\nBabysitting Baby Dolls https://youtu.be/IGmgy_zaUiA\nPrincess Makeup & Dress Up https://youtu.be/QzIUBQvN7to",
      "publishedAt": "2019-04-03T12:00:10Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/o0e1_rV_oms/hqdefault.jpg",
      "videoId": "o0e1_rV_oms",
      "viewCount": 286359571,
      "likeCount": 700237
    },
    {
      "title": "Alex and Eric Pretend Play Pizza Drive Thru Restaurant | Funny Food Toys Story",
      "description": "Eric is running a pretend play pizza drive thru and Alex is craving some yummy pizza! Watch to see what happens in this funny story for kids about food toys. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-05-25T12:00:41Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/wPGYtnv4HSY/hqdefault.jpg",
      "videoId": "wPGYtnv4HSY",
      "viewCount": 582124023,
      "likeCount": 1282786
    },
    {
      "title": "Jannie Pretend Play Baking with Happy Birthday Day Cake & Kitchen Toys",
      "description": "Jannie pretend play baking with her happy birthday cake toy and kitchen toys! Jannie is late for the bus that takes her to Auntie’s birthday party. Uncle K takes her on his wagon, but Jannie accidentally dropped the cake. They go to the cake store to bake another cake for Auntie. After they are done, Uncle K drops her off at Auntie’s place. Jannie gifts Auntie the birthday cake toy as a cute birthday present. Auntie is so impressed by Jannie’s cute birthday cake, so she goes to the toy store and buys her a birthday cake store. Jannie and Auntie work together and make a bunch of birthday cakes with the kitchen toys!",
      "publishedAt": "2018-07-23T12:00:03Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/dYiyGUUSdgk/hqdefault.jpg",
      "videoId": "dYiyGUUSdgk",
      "viewCount": 209212463,
      "likeCount": 543400
    },
    {
      "title": "Emma Jannie & Wendy Pretend Play Halloween Trick Or Treat Costume Dress Up for Candy Haul",
      "description": "Emma, Jannie, Wendy, and Lyndon pretend play Halloween trick or treating for huge candy haul! Emma wakes up everybody to get costumes to go trick or treating. They try out a bunch of different costumes to find out which one is the best. Jannie is Aurora, Emma is Elsa, Wendy is a witch, and Lyndon is a giant pumpkin. First they go to Uncle Tim’s house, but it was super spooky and scary! Uncle Tim was dressed up as a clown and gave them some candy! After that they went over to Auntie’s house. Auntie dressed up as Maleficent and decorated her house with webs and bats. Lastly they went to Uncle K’s house, but he didn’t decorate his house or candy because the stores sold out! However, they head over to Uncle John’s store and he still had a bunch of Halloween stuff. They buy decorations to help Uncle K’s house look cool and spooky.",
      "publishedAt": "2018-10-25T11:58:28Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/a27Q0LlNZSk/hqdefault.jpg",
      "videoId": "a27Q0LlNZSk",
      "viewCount": 478874630,
      "likeCount": 1108155
    },
    {
      "title": "Wendy and Alex Pretend Play as Grownup Adults | Funny Children Stories",
      "description": "Wendy and Alex want to do things that grownups do, but learn that it is more fun to be a kid!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-03-12T12:00:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/2wwKoI09mNQ/hqdefault.jpg",
      "videoId": "2wwKoI09mNQ",
      "viewCount": 400074494,
      "likeCount": 995655
    },
    {
      "title": "Maddie and Charlotte Learns Library Rules and Manners",
      "description": "Maddie's phone rings loudly in the quiet library, prompting Uncle Jim to gently remind her again about the rules. Maddie apologizes and turns off her phone. Feeling hungry, Maddie snacks on some chips, but soon learns that eating in the library is against the rules too. With Uncle Jim's patient guidance, Maddie learns the importance of following rules in shared spaces. By the end, Maddie is peacefully reading a book, respects the library's quiet atmosphere, and leaves with a smile and a valuable lesson. This episode teaches the importance of respecting shared spaces and following the rules, as they are in place for the benefit of everyone.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-08-13T11:30:05Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/6tVRZ7E3dwk/hqdefault.jpg",
      "videoId": "6tVRZ7E3dwk",
      "viewCount": 205847341,
      "likeCount": 3139516
    },
    {
      "title": "Johny Johny Yes Papa Song | Wendy Wash Hand & Brush Teeth Nursery Rhymes Songs",
      "description": "New Johny Johny Yes Papa song where Wendy helping kids learn how to wash your hands and brush your teeth to fun nursery rhymes songs. Wendy really wants to eat french fries, but Uncle John tells her to wash her hands before eating. Wendy also teaches toddler Liam to wash his hands and brush his teeth before eating and after finish playing. Do you wash your hands often?",
      "publishedAt": "2019-02-12T13:00:03Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/7hFQC3nmm2c/hqdefault.jpg",
      "videoId": "7hFQC3nmm2c",
      "viewCount": 361443766,
      "likeCount": 1108419
    },
    {
      "title": "Ellie's Broken Doll House Mystery with Eric!",
      "description": "Ellie's doll house gets broken. Ellie, surprised and upset, discovers Eric playing soccer nearby and suspects him. She suggests using a lie detector to find out the truth. Eric initially denies breaking the doll house, but the lie detector reveals he's not telling the truth. Caught, Eric admits he accidentally hit the doll house while playing soccer but also reveals that he fixed it immediately. The lie detector confirms Eric's honesty this time.\n\nJust as things seem to be resolved, Uncle enters the scene with another accidental hit to the doll house with a soccer ball. He takes responsibility and promises to fix it. Both Eric and Ellie join in to help repair the doll house. The story concludes with a humorous twist as Uncle, while putting away the soccer ball, accidentally drops it, hinting at more unintended chaos.\n\nLesson Learned\nThe key lesson from this video is the importance of honesty and taking responsibility for one's actions. Eric learns that it's better to admit a mistake and fix it than to deny it. Ellie learns not to jump to conclusions and blame others without knowing the whole story. Together, they learn about teamwork and fixing problems cooperatively.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-12-01T12:45:00Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/1K4T_Ea0h8U/hqdefault.jpg",
      "videoId": "1K4T_Ea0h8U",
      "viewCount": 296350584,
      "likeCount": 4729881
    },
    {
      "title": "Jannie Wants to Be a Good Sister for Ellie",
      "description": "Jannie pretend to play a fun story with Ellie about how to be a good sister. Jannie spends the whole day with Ellie and plays, eats, brushes their teeth, and has fun together. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy\n\n#jannie #toysandcolors #pretendplay",
      "publishedAt": "2021-05-15T12:00:15Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/l35nWsEJlFY/hqdefault.jpg",
      "videoId": "l35nWsEJlFY",
      "viewCount": 288393909,
      "likeCount": 616554
    },
    {
      "title": "Jobs Career & Professions Song | Wendy & Friends Pretend Play Nursery Rhymes Kids Songs",
      "description": "Wendy, Alex, and Liam pretend play sing to the Jobs Career and Professions song! This fun nursery rhymes for children will help kids decide what they want to be when they grow up. \n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-06-10T12:00:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/PV6biSsmS80/hqdefault.jpg",
      "videoId": "PV6biSsmS80",
      "viewCount": 349375701,
      "likeCount": 979831
    },
    {
      "title": "Ellie's Big Oops and the Time-Out Adventure",
      "description": "Ellie, a young girl with a playful spirit and a knack for knocking things over. The fun begins when Ellie accidentally knocks down a vase with a ball. It shatters into pieces and in a quick attempt to avoid trouble, she blames it on the cat. Auntie, hearing the noise, comes into the room and gives the unsuspecting cat a time-out.\n\nLater, Ellie moves to the kitchen, where she ends up dropping her cereal bowl. Again, she blames it on the cat, but Auntie is quick to point out that the cat is in time-out and couldn't have caused the accident. Caught in her fib, Ellie goes to time-out.\n\nThe video concludes with Auntie teaching Ellie an important lesson about responsibility. Ellie learns that she must own up to her mistakes rather than blaming others. She apologizes, and Auntie lets her know that her time-out is over.\n\nLesson Learned:\nIt's essential to take responsibility for our actions and not blame others for our mistakes.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-06-30T11:30:05Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/J72j6UwQl3o/hqdefault.jpg",
      "videoId": "J72j6UwQl3o",
      "viewCount": 273974274,
      "likeCount": 3807545
    },
    {
      "title": "Wendy Pretend Play Mixing Slimes & Fun Slime Challenge",
      "description": "Wendy and Uncle K pretend play mixing a lot of different slimes together and do a fun slime challenge! Do you like playing and mixing slimes?\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-08-05T12:00:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/Jddj8cthldw/hqdefault.jpg",
      "videoId": "Jddj8cthldw",
      "viewCount": 267817773,
      "likeCount": 711177
    },
    {
      "title": "ABC Song | Wendy Pretend Play Learning Alphabet w/ Toys & Nursery Rhyme Songs",
      "description": "Wendy and Lyndon pretend play learning their ABCs with toys and nursery rhyme song. Wendy is playing with her alphabet toys and suddenly they start disappearing! She runs around looking for the ABC toys. With the help of her Auntie and Uncles she was able to find all of her ABC letters! After she finished finding all of the letters she teaches the alphabet to us with her friend Lyndon! They match the letters to an animal.",
      "publishedAt": "2018-11-04T13:00:02Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/BNTCpF_n6J4/hqdefault.jpg",
      "videoId": "BNTCpF_n6J4",
      "viewCount": 1093099959,
      "likeCount": 2585291
    },
    {
      "title": "The Ultimate Color Battle: Maddie's Black World vs Charlotte's Pink World!",
      "description": "Maddie and Charlotte explore the worlds of black and pink! Watch as the two friends discover the fun of transforming sticky notes, playing with slime, and decorating cakes in their favorite colors. From using mysterious hands to help them out to combining their creative powers, Maddie and Charlotte show that sometimes, the best results come from working together and embracing both sides of the color spectrum.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-05-19T11:30:04Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/G67QlGPFjGY/hqdefault.jpg",
      "videoId": "G67QlGPFjGY",
      "viewCount": 417445452,
      "likeCount": 6736083
    },
    {
      "title": "Emma Pretend Play w/ Luggage Suitcase Scooter Ride On Toy",
      "description": "Emma pretend play with a luggage and suitcase that is also a scooter ride on toy. Emma gets a luggage scooter at the toy store to help carry her musical instrument toys and to get to places faster. Uncle K shows her how to ride on it and also how to brake. They go to the talent show and sing nursery rhymes kid songs with their musical instrument toys.",
      "publishedAt": "2019-02-16T13:00:01Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/9-ZNdSoRVDk/hqdefault.jpg",
      "videoId": "9-ZNdSoRVDk",
      "viewCount": 218737686,
      "likeCount": 509338
    },
    {
      "title": "Put On Your Shoes Song  Wendy Pretend Play Morning Routine Brush Teeth Nursery Rhymes Kids Songs",
      "description": "Wendy pretend play to the Put on Your Shoes song! Uncle K wakes her up and makes her do her morning routine before going to school.\n\nLyrics:\n\nGo brush your teeth\nYour teeth \nYour teeth\nGo brush your teeth \nYour teeth \nYour teeth\nGo brush your teeth\nIt’s time for school! \nLet’s go \nLet’s go \nLet’s go! \n\nWhere are your shoes? \nYour shoes \nYour shoes \nLook for your shoes \nYour shoes \nYour shoes \nWear your shoes \nIt’s time for school! \nLet’s go \nLet’s go \nLet’s go! \n\nWhere is your jacket \nYour jacket \nYour jacket\nLook for your jacket\nYour jacket \nYour jacket \nWear your jacket \nIt’s time for school!\nLet’s go \nLet’s go \nLet’s go! \n\nWhere is your backpack \nYour backpack \nYour backpack\nLook for your backpack \nYour backpack \nYour backpack \nWear your backpack \nIt’s time for school!\nLet’s go \nLet’s go \nLet’s go! \n\nWhere is your homework? \nYour homework \nYour homework?\nLook for your homework \nYour homework \nYour homework \nGo get your homework \nIt’s time for school!\nLet’s go \nLet’s go \nLet’s go! \n\nYou brushed your teeth \nPut on your shoes \nPut on your jacket \nPut on your backpack \nYou have your homework \nIt’s time for school! \nLet’s go \nLet’s go\nLet’s go!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2019-06-04T12:00:09Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/kigQ0QHZgzM/hqdefault.jpg",
      "videoId": "kigQ0QHZgzM",
      "viewCount": 350690145,
      "likeCount": 776449
    },
    {
      "title": "Wendy Pretend Play with Giant Water Slide & Inflatable Swimming Pool Kid Toys for Girls",
      "description": "Wendy pretend play with giant water pool side and her Barbie cruise ship girl toys. Wendy loves slides and plays with a few at the playground park. They go home and Uncle K tells her to play in the kiddie pool while he is cleaning the backyard. She takes the Rapunzel and Elsa dolls with the cruise ship into the kiddie inflatable swimming pool. She lets them swim and go down the small slide. Uncle K is finally done cleaning up and takes Wendy to the big pool and giant water slide. Lyndon comes and joins the fun when they go play in the pool.",
      "publishedAt": "2018-08-20T12:00:04Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/NEZ59NtGpoc/hqdefault.jpg",
      "videoId": "NEZ59NtGpoc",
      "viewCount": 278140835,
      "likeCount": 431348
    },
    {
      "title": "Wendy Pretend Play with ICE CREAM Drive Thru Toy Store",
      "description": "Wendy pretend plays with her ice cream drive thru toy store! She is selling all kinds of different ice cream toys. Auntie arrives and orders a banana split with extra toppings. The baby doll also wants some ice cream and Auntie orders more. Uncle John has a hotdog store, but he has no customers! He has an idea to make an ice cream store to compete with Wendy! Auntie runs over to Uncle John’s ice cream cart store to buy some ice cream. Oh no! Uncle John doesn’t have any ice cream toys, but he only has the cones. So, he puts in hotdogs instead of ice cream and serves it to Auntie. Auntie didn’t like the hotdog ice cream, so she goes back to Wendy’s store and buys a popsicle toy. Uncle John is super sad that nobody is buying his ice cream. Wendy tells him he needs ice cream instead of hotdogs in his ice cream cone. She takes him to the toy store and they buy some ice cream toys. They go back and Wendy shows him how to make some ice cream and goes back to her store. Uncle John made a the ice cream cone wrong for Auntie and Wendy hires him to make ice cream at her shop to train him.",
      "publishedAt": "2018-06-25T12:00:03Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/srRnCuwhdfQ/hqdefault.jpg",
      "videoId": "srRnCuwhdfQ",
      "viewCount": 457453754,
      "likeCount": 1256992
    },
    {
      "title": "Fun Rescue Missions with Police Ellie, Firefighter Charlotte, and Builder Beth",
      "description": "Mischief-maker Bad Guy Jim making a mess all around the house. However, Ellie is ready for action! She steps into the blue booth, transforming into a fearless police officer. With a swift swoop, she catches Jim, instructs him to clean up his mess, and gives him a time-out. Ellie is proud to be a police officer and claims, \"Police officers are the best. I am the best!\"\n\nSuddenly, the siren blares again, this time from the red booth! Uncle Roy's house is on fire, and he urgently needs help. This time, it's Charlotte's turn. She hops into the red booth and emerges as a brave firefighter. With her firefighter skills, she extinguishes the blaze, saving Uncle Roy's house. Overjoyed, Uncle Roy expresses his thanks, and Charlotte beams, declaring, \"Firefighters are the best!\"\n\nFinally, the siren echoes once more from the yellow booth. Uncle Roy's house, unfortunately, has been left damaged from the previous events. Auntie Beth is quick to respond, stepping into the yellow booth and transforming into a skilled builder. With patience and precision, she rebuilds Uncle Roy's house out of vibrant, fun Lego bricks. Auntie Beth concludes the adventure by stating, \"Construction workers are the best!\"\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-05-26T11:30:06Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/Iv3IKdBIyJ0/hqdefault.jpg",
      "videoId": "Iv3IKdBIyJ0",
      "viewCount": 275944380,
      "likeCount": 4607516
    },
    {
      "title": "Going To The Dentist Song | Alex Pretend Play Sing-Along to Nursery Rhymes Kids Songs",
      "description": "Sing-along to the Going to the Dentist song with Alex and his family! This fun nursery rhyme song for kids will show them why it’s important to eat healthier food, brush your teeth, and visit the dentist.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-05-13T12:00:15Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/IVqKLxp6R4U/hqdefault.jpg",
      "videoId": "IVqKLxp6R4U",
      "viewCount": 1132436141,
      "likeCount": 2358784
    },
    {
      "title": "Maddie & Charlotte Tiny Heroes on a Big Mission! 🚒🚓🚧",
      "description": "Watch Maddie and Charlotte transform into mini police officers, firefighters, and builders in this heartwarming YouTube Shorts! 🌟 Join these tiny heroes as they help people in their neighborhood, making a big difference with their bravery and teamwork. 🚒🚓🚧 Get ready to be inspired by their adorable adventures and learn about the importance of these professions. Don't forget to like, share, and subscribe for more fun videos! 💕 \n\n#TinyHeroes #MaddieAndCharlotte #KidsRoleplay\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-03-31T11:30:24Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/hXYhTBj-CzE/hqdefault.jpg",
      "videoId": "hXYhTBj-CzE",
      "viewCount": 223290682,
      "likeCount": 3387809
    },
    {
      "title": "Wendy Pretend Play w/ Hello Kitty Kitchen &Tea Party Kids Food Toys",
      "description": "Wendy pretend play with her new Hello Kitty kitchen playset and has a tea party! Wendy and Auntie Joyce is preparing food and drinks for their tea party, but suddenly the toy doesn’t work anymore. Auntie Joyce brings it to Uncle John the toy fixer and he fixes it for her. They prepare a bunch of food such as cake, fruits, cupcakes, pies, tea, and more for the party! They also have fun singing and dancing the bingo song.",
      "publishedAt": "2018-12-10T13:00:03Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/NFUivBelIAA/hqdefault.jpg",
      "videoId": "NFUivBelIAA",
      "viewCount": 197378736,
      "likeCount": 318719
    },
    {
      "title": "Lets Go Shopping Song | Nursery Rhymes and Kids Songs",
      "description": "Emma, Jannie and Liam sing-along to the Lets Go Shopping song by Toys and Colors. They learn that it is nice to share their treats with their friends. This fun nursery rhymes song for kids about going shopping for chocolate will have them singing and dancing!\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2020-03-04T13:00:09Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/rQGjOZC922o/hqdefault.jpg",
      "videoId": "rQGjOZC922o",
      "viewCount": 232669261,
      "likeCount": 488919
    },
    {
      "title": "Learning to Share: Maddie and Charlotte's Sharing is Caring Story",
      "description": "Maddie is fully engaged in a game of car wash, but she prefers to play alone, leaving her friend Charlotte feeling left out. Maddie's day continues as she takes a snack break and snacks on some delicious fruits from a vending machine, but once again, she refuses to share with Charlotte, leaving her friend disappointed.\n\nSeeing this, Uncle steps in and reminds Maddie about the importance of sharing, but Maddie ignores his advice and keeps enjoying her fruits and toys all by herself. But soon, Maddie experiences a twist of fate; both her vending machine and car wash toys break down. Maddie is left feeling sad and confused, and it is at this moment Charlotte steps in with a helping hand. She fixes both the vending machine and car wash toys, showing Maddie the power of sharing and kindness.\n\nBefore Charlotte leaves, Maddie apologizes for her earlier behavior and invites Charlotte to play with her and share her fruits. They both enjoy the fruits and toys, learning that sharing really is caring, leaving Uncle smiling at this positive turn of events. In the end, they all laugh together, having learned a valuable lesson.\n\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-06-02T11:30:18Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/t5EVv7t59oc/hqdefault.jpg",
      "videoId": "t5EVv7t59oc",
      "viewCount": 507135741,
      "likeCount": 7651564
    },
    {
      "title": "Germs Beware! Ellie Learns to Wash Hands",
      "description": "Ellie learns about the crucial role of good hygiene in our daily life. It emphasizes the importance of washing hands, especially after playing with dirty toys or after sneezing, to prevent the spread of germs and stay healthy. By linking these actions to fun and relatable characters, kids are more likely to remember and practice these healthy habits.\n\nSubscribe for notifications to new videos: https://www.youtube.com/channel/UCgFXm4TI8htWmCyJ6cVPG_A?sub_confirmation=1\n\nCheck out our latest videos playlist: https://www.youtube.com/watch?v=fsHnS3mZglg&list=PL5gq3QGk5j3hRwpMNKQ9L5NyUt3FiTmSy",
      "publishedAt": "2023-07-30T11:30:14Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/YnnY5NBPin8/hqdefault.jpg",
      "videoId": "YnnY5NBPin8",
      "viewCount": 224537525,
      "likeCount": 3132909
    },
    {
      "title": "Emma & Wendy Pretend Play with Musical Instrument Toys for Kids & Sing Nursery Rhymes",
      "description": "Emma & Wendy pretend play with musical instruments and start their own band to sing nursery rhyme songs! Wendy has a cool keyboard and Emma has a drum. Wendy decided to play with Emma’s drum, but accidentally broke it. Wendy took the toy to the toy fixer to fix it. Emma thought Wendy took her drum and followed her. Wendy felt bad, so they all went to the toy store to buy Emma a new drum. The toy seller didn’t have any drums in stock, but instead had a cool microphone and Disney Frozen ukulele. The toy seller went to his storage to see if he still had a drum set for Emma. Emma, Wendy, and the Uncle Tim sang the nursery rhyme Johny Johny Yes Papa (Emma Wendy version) together. They went back home and played their toy instruments together. The band sang Rain Rain Go Away, The ABC Alphabet song, and Old MacDonald Had a Farm!",
      "publishedAt": "2018-06-03T12:00:01Z",
      "thumbnailUrl": "https://i.ytimg.com/vi/HU7daeoid5o/hqdefault.jpg",
      "videoId": "HU7daeoid5o",
      "viewCount": 219852651,
      "likeCount": 525458
    }
  ]
}