[
  {
    "id": "UCxsJPQ03c9qHaZuepJYEq5Q",
    "title": "Monster Hunter: World - Topic",
    "description": "Welcome to a new world! In Monster Hunter: World, the latest installment in the series, you can enjoy the ultimate hunting experience, using everything at your disposal to hunt monsters in a new world teeming with surprises and excitement.\nThis channel was generated automatically by YouTube's video discovery system.",
    "bannerUrl": "https://yt3.googleusercontent.com/w0ByoZlzH_YxxOYJldgzlIeE9uu5EUlx6dLEbukAtYnqOyE-d_21DYlOk2Ibp4rIssO2GTEpnA",
    "thumbnails": "https://yt3.ggpht.com/bfeEwEeBDZ_Y82JDRf3YJhUZafkbWIQkAIburSzoWKxCpUKjrCMbg9N1dT7SmVFD79nuW43I5A=s800-c-k-c0x00ffffff-no-rj",
    "viewCount": 0,
    "subscriberCount": 32100,
    "videoCount": 0
  },
  {
    "id": "UCk8GzjMOrta8yxDcKfylJYw",
    "title": "✿ Kids Diana Show",
    "description": "Welcome to Diana and Roma world - where Diana, Roma, little Oliver and their parents play, learn, sing, explore and share their life experiences. Millions of kids and families from all over the world join Diana and Roma every day to explore the world and learn about songs, numbers, nature, colors, shapes, animals, and the importance of eating healthy food, washing hands, being a good friend, and much more.\nAll rights reserved. This visual production contains original artistic content and ideas and is protected by U.S. and international laws. Reproduction and distribution of this visual presentation without written expressed permission of the copyright holder/ author is prohibited.\nDiana and Roma is the top rated kids' YouTube channel . Since launching on YouTube in 2015, Kids Diana Show has attracted over 200+ million worldwide subscribers and 100+ billion views, while on average 10 billion monthly views on 20 channels and translated into 20 languages.\nE-mail: dianaromabiz@gmail.com",
    "bannerUrl": "https://yt3.googleusercontent.com/wqujDh1R0G4UxNgKr7Z5RK1XAbGXZh1B9sO0EZsuDdQxAt3xLNbyCVeU5Dy77AB3O8PzpIOfCA",
    "thumbnails": "https://yt3.ggpht.com/ytc/AIdro_nXPizlWeJZGOjnuokCFpcn1T38xLKSJnqSt14HfDtR1r0=s800-c-k-c0x00ffffff-no-rj",
    "viewCount": 105537213502,
    "subscriberCount": 125000000,
    "videoCount": 1250
  }
]
