[
  {
    "id": "UCxsJPQ03c9qHaZuepJYEq5Q",
    "title": "Monster Hunter: World - Topic",
    "description": "Monster Hunter: World is a 2018 action role-playing game developed and published by Capcom. The fifth mainline installment in the Monster Hunter series, it was released worldwide for PlayStation 4 and Xbox One in January 2018, with a Windows version following in August 2018. In the game, the player takes the role of a Hunter, tasked to hunt down and either kill or trap monsters that roam in one of several environmental spaces. If successful, the player is rewarded through loot consisting of parts from the monster and other elements that are used to craft weapons and armor, amongst other equipment. The game's core loop has the player crafting appropriate gear to be able to hunt down more difficult monsters, which in turn provide parts that lead to more powerful gear. Players may hunt alone or in a group of up to four players via the game's online multiplayer.\nAnnounced at E3 2017, Monster Hunter: World adop...\nThis channel was generated automatically by YouTube's video discovery system.",
    "bannerUrl": "https://yt3.googleusercontent.com/w0ByoZlzH_YxxOYJldgzlIeE9uu5EUlx6dLEbukAtYnqOyE-d_21DYlOk2Ibp4rIssO2GTEpnA",
    "thumbnails": "https://yt3.ggpht.com/bfeEwEeBDZ_Y82JDRf3YJhUZafkbWIQkAIburSzoWKxCpUKjrCMbg9N1dT7SmVFD79nuW43I5A=s800-c-k-c0x00ffffff-no-rj",
    "viewCount": "0",
    "subscriberCount": "32100",
    "hiddenSubscriberCount": false,
    "videoCount": "0"
  },
  {
    "id": "UCk8GzjMOrta8yxDcKfylJYw",
    "title": "✿ Kids Diana Show",
    "description": "Welcome to Diana and Roma world - where Diana, Roma, little Oliver and their parents play, learn, sing, explore and share their life experiences. Millions of kids and families from all over the world join Diana and Roma every day to explore the world and learn about songs, numbers, nature, colors, shapes, animals, and the importance of eating healthy food, washing hands, being a good friend, and much more.\nAll rights reserved. This visual production contains original artistic content and ideas and is protected by U.S. and international laws. Reproduction and distribution of this visual presentation without written expressed permission of the copyright holder/ author is prohibited.\nDiana and Roma is the top rated kids' YouTube channel . Since launching on YouTube in 2015, Kids Diana Show has attracted over 200+ million worldwide subscribers and 100+ billion views, while on average 10 billion monthly views on 20 channels and translated into 20 languages.\nE-mail: dianaromabiz@gmail.com",
    "bannerUrl": "https://yt3.googleusercontent.com/wqujDh1R0G4UxNgKr7Z5RK1XAbGXZh1B9sO0EZsuDdQxAt3xLNbyCVeU5Dy77AB3O8PzpIOfCA",
    "thumbnails": "https://yt3.ggpht.com/ytc/AIdro_nXPizlWeJZGOjnuokCFpcn1T38xLKSJnqSt14HfDtR1r0=s800-c-k-c0x00ffffff-no-rj",
    "viewCount": "105504322626",
    "subscriberCount": "125000000",
    "hiddenSubscriberCount": false,
    "videoCount": "1249"
  }
]